src/post_tonal_overtone/org_files/html-versions/build-voice-leading-engine.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-02 Fri 15:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="b" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">1. setting-up</a>
<ul>
<li><a href="#orgheadline1">1.1. steps</a></li>
<li><a href="#orgheadline4">1.2. considerations</a>
<ul>
<li><a href="#orgheadline2">1.2.1. printing to standard out</a></li>
<li><a href="#orgheadline3">1.2.2. idiomatic usage</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline10">2. loading namespaces and using the relevant vars</a>
<ul>
<li><a href="#orgheadline6">2.1. repl vs. babel</a></li>
<li><a href="#orgheadline9">2.2. see what's available</a>
<ul>
<li><a href="#orgheadline7">2.2.1. resources that have been loaded in the background</a></li>
<li><a href="#orgheadline8">2.2.2. background libraries</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline17">3. check basic sounds and levels</a>
<ul>
<li><a href="#orgheadline13">3.1. sin wave</a>
<ul>
<li><a href="#orgheadline11">3.1.1. basic</a></li>
<li><a href="#orgheadline12">3.1.2. louder</a></li>
</ul>
</li>
<li><a href="#orgheadline14">3.2. white noise</a></li>
<li><a href="#orgheadline16">3.3. loaded samples</a>
<ul>
<li><a href="#orgheadline15">3.3.1. piano</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline43">4. construct meaningful musical units</a>
<ul>
<li><a href="#orgheadline22">4.1. all-important idiom for playing a chord</a>
<ul>
<li><a href="#orgheadline18">4.1.1. simple middle C triad</a></li>
<li><a href="#orgheadline21">4.1.2. randomly voice an A7 flat9 sharp13, play chord as side-effect</a></li>
</ul>
</li>
<li><a href="#orgheadline32">4.2. remember meaningful phenomena</a>
<ul>
<li><a href="#orgheadline23">4.2.1. write 6 note voicing to disk</a></li>
<li><a href="#orgheadline24">4.2.2. stateful versions (?)</a></li>
<li><a href="#orgheadline25">4.2.3. using an atom and swap to derefence and set a new value</a></li>
<li><a href="#orgheadline26">4.2.4. let's make a cycle with a few more things</a></li>
<li><a href="#orgheadline27">4.2.5. working with stateful objects without atom management</a></li>
<li><a href="#orgheadline28">4.2.6. reading from and writing to disk</a></li>
<li><a href="#orgheadline29">4.2.7. we want to read-write with streams instead</a></li>
<li><a href="#orgheadline30">4.2.8. with-open and java file writing interop</a></li>
<li><a href="#orgheadline31">4.2.9. developing an understanding of state</a></li>
</ul>
</li>
<li><a href="#orgheadline42">4.3. playing a melody involves time idioms</a>
<ul>
<li><a href="#orgheadline33">4.3.1. start simply with 'this' moment</a></li>
<li><a href="#orgheadline36">4.3.2. using a metronome as timer for more sequenced items</a></li>
<li><a href="#orgheadline41">4.3.3. defined <code>play</code> doesn't have an example in the documentation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline48">5. generate large databases of musical events</a>
<ul>
<li><a href="#orgheadline44">5.1. transpose triply nested list</a></li>
<li><a href="#orgheadline46">5.2. start working with keyworded maps instead of unadorned lists</a>
<ul>
<li><a href="#orgheadline45">5.2.1. basic uses of hashes (sets)</a></li>
</ul>
</li>
<li><a href="#orgheadline47">5.3. note names vs. midi numbers&#x2013;note vs. find-note-name</a></li>
</ul>
</li>
<li><a href="#orgheadline49">6. data</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> setting-up</h2>
<div class="outline-text-2" id="text-1">
<p>
Each tutorial assumes you are starting up cold. While actually doing
so may seem an inconvenience (why would you ever want to leave
emacs??), it actuall is a good practice, akin to a conceptual and
code spring-cleaning.
</p>
</div>
<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> steps</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Once you have followed the below steps:
</p>

<ol class="org-ol">
<li></li>
</ol>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #DCDCCC; font-weight: bold;">cd</span> ~/git-projects/post_tonal_overtone
lein repl
</pre>
</div>

<p>
or <code>cider-jack-in</code> from within the post<sub>tonal</sub><sub>overtone</sub>
directory within emacs
</p>

<ol class="org-ol">
<li></li>
</ol>

<p>
evaluate (C-c C-k using CIDER) the post<sub>tonal</sub><sub>definitions.clj</sub> file 
</p>

<p>
You will hopefully see overtone loading up in your cider-repl.
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.2</span> considerations</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.2.1</span> printing to standard out</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
One advantage to starting a lein repl and then connecting cider to it
(with cider-connect) is that the terminal window (which becomes
dedicated to the overtone server once overtone is loaded) seems happy
to <code>println</code> things that cider-repl doesn't. 
</p>

<p>
For example see this function from an earlier section.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">voice-and-transpose-rand-set</span> [set-type tn-level]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [set (rand-nth set-type)
        voiced-set (map #(+ (rand-nth [36 48 60 72]) <span style="color: #DFAF8F;">%</span>) set)
        visible-pairings (map #(list <span style="color: #DFAF8F;">%</span> (mod <span style="color: #DFAF8F;">%</span> 12)) voiced-set)
        transposed-set (map #(+ tn-level <span style="color: #DFAF8F;">%</span>) voiced-set)
        paired-transposed-set (map #(list (mod <span style="color: #DFAF8F;">%</span> 12) (+ tn-level <span style="color: #DFAF8F;">%</span>)) (sort voiced-set))
        set-voicing-group (list <span style="color: #BFEBBF;">:set</span> set
                                <span style="color: #BFEBBF;">:tn-level</span> tn-level
                                <span style="color: #BFEBBF;">:reg</span> visible-pairings
                                <span style="color: #BFEBBF;">:sorted-trans</span> paired-transposed-set)]
    (<span style="color: #F0DFAF; font-weight: bold;">do</span>
      (println set-voicing-group)
      #_<span style="color: #7F9F7F;">set-voicing-group</span> transposed-set)))

(voice-and-transpose-rand-set trichords 3)

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(voice-and-transpose-rand-set set-class/trichords 3)</span>
</pre>
</div>



<p>
Also, note that whether you start cider from within the /src directory
or the project directory will make a difference. Use the top-level
project directory, with the project.clj file.
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.2.2</span> idiomatic usage</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
What's the best way to set-up and define functions? For example the
above function is perhaps a little on the large side, and appears to
be doing a lot in the span of its one let form. Additionally, the
function as it is written is called with two arguments&#x2013;is there
another way to do this that would present any relative advantages?
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">2</span> loading namespaces and using the relevant vars</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.1</span> repl vs. babel</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Again, there's more than one way to do this. You can choose to have
babel-blocks do the loading, but in this case the repl will remain
ignorant of what has been taking place (this hasn't always seemed to
be the case when working with both. But for whatever I have done, it
always seems to be the case now).
</p>

<p>
Maybe name a session to help learn about how babel and cider will
interact around namespaces
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">in-ns</span> '<span style="color: #7CB8BB;">post_tonal_overtone.core</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #DCDCCC; font-weight: bold;">*ns*</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #DCDCCC; font-weight: bold;">*ns*</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.2</span> see what's available</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">2.2.1</span> resources that have been loaded in the background</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Do you have access to certain data structures you are going to want to
use? If not, how do you load these things?
</p>

<p>
A "cheap" way is just to go to a file that contains such a <code>def</code>
statement and evaluate it right there
</p>
<div class="org-src-container">

<pre class="src src-clojure">cmajtriads
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #7CB8BB;">set-class</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>cmajtriads
</pre>
</div>
</div>
</div>
