src/post_tonal_overtone/org_files/build-voice-leading-engine.org
*** background libraries
What about libraries of functions that you might want to use? What
kind of namespace-qualification are you going to have to use? Will you
need to ~use~ anything directly?

#+BEGIN_SRC clojure :session vle
(finite-prob/certainly 11)
#+END_SRC

#+RESULTS:
| 11 | 1 |

Take a look at some of the vars defined in other namespaces. Do you
know what they are, or how to use them? 

How far should you go with trying to document what you're using?
Personally, I like to err on the side of overly comprehensive, which
working with emacs and org-mode makes possible and not excessively
distracting.

#+BEGIN_SRC clojure :results output
(dir post_tonal_overtone.probability_functions.finite-distributions)
#+END_SRC

#+RESULTS:
#+begin_example
bernoulli
binomial
certainly
choose
cond-dist-m
cond-prob
dist-m
join-with
make-distribution
normalize
normalize-cond
prob
select
uniform
zipf
#+end_example

Note, during all this loading and checking, you may have received
mysterious errors. Have you checked your REPL lately? There may be
subtle spelling or procedural mistakes that you have made which you
will want to "debug" from the sometimes obscure error messages you
receive.

* check basic sounds and levels
This is akin to what happens at live shows, where the musician's and
sound engineers do "sound checks" (or really "line checks," in the
case of just making sure everything is working).
** sin wave
*** basic
#+BEGIN_SRC clojure :session vle
(demo (sin-osc))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 41>
*** louder
#+BEGIN_SRC clojure :session vle
(demo  (out 0 (* 2 (sin-osc))))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 42>

** white noise

#+BEGIN_SRC clojure :session vle
(demo (white-noise))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 43>
** loaded samples
*** piano
#+BEGIN_SRC clojure :session vle
(sampled-piano)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: overtone.inst.973/sampled-piano 45>

#+BEGIN_SRC clojure :session vle
(sampled-piano (note :A4))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: overtone.inst.973/sampled-piano 46>
* construct meaningful musical units
In all the tutorials so far we have used the =doseq= function. Here it
is again, taken out of context and with some imagined function body
after the initial binding form.
** all-important idiom for playing a chord
#+BEGIN_SRC clojure
  (doseq [note a-chord] ;;pseudocode (player-function note))
#+END_SRC
*** simple middle C triad
So begin to note how the =doseq= function does what it does, which is
especially useful to us when we are interested in doing something
repetitive like playing all the notes in a chord.

#+BEGIN_SRC clojure :session vle
(defn play-piano-chord [a-chord]
        (doseq [note a-chord] (sampled-piano note)))

(play-piano-chord [60 64 67])
#+END_SRC

  #+RESULTS:
  : #'user/play-piano-chordnil
*** randomly voice an A7 flat9 sharp13, play chord as side-effect
So, with that reminder of how we can tidily play chords, we can now
look a little more deeply at some techniques for accessing and
rendering chords as built in to overtone.

**** 4 note voicings using built-in overtone functionality
     :PROPERTIES:
     :Freq_ALL: 1
     :END:
In the last tutorial, I spent most of my time dealing with the kinds
of harmonies that characterize post-tonal music. Overtone, however,
has ample support for the harmonic organization that typifies tonal
music, that is the chords and scales of Western (and some non-Western)
music. 

Without going into too much of a digression on the sometimes
overly-casual distinctions between tonal, post-tonal and "centric"
music, let's just look at (and listen to) a quick cool bit of
functionality.

#+BEGIN_SRC clojure :session vle :results output
;; overtone.live/rand-chord
;; ([root chord-name num-pitches pitch-range])
;;   Generates a random list of MIDI notes with cardinality num-pitches
;;   bound within the range of the specified root and pitch-range and
;;   only containing pitches within the specified chord-name. Similar to
;;   Impromptu's pc:make-chord

(defn mod12 [n] (mod n 12))

(let [midis (rand-chord :A2 :7+5-9 4 48)]
(do (println (map find-note-name midis))
    (println midis)
    (println (map mod12 midis))
    (play-piano-chord midis)
  ))
#+END_SRC

#+RESULTS:
: (:F3 :Bb3 :A4 :C#5)
: (53 58 69 73)
: (5 10 9 1)

Overtone supplies a rich set of built-in keyword args for dealing with
a system of naming chords that is common to jazz and 20th century
popular music: a mix of names and Arabic numberal, with a few odd
other symbols thrown in there.

Consulting the overtone documentation for chord only gives a small
picture of what actually is available when we crack open the overtone
=pitch.clj= source file.

#+BEGIN_SRC clojure :results output
(source chord)
#+END_SRC

#+RESULTS:
#+begin_example
(defn chord
  "Returns a set of notes for the specified chord. The root must be in
  midi note format i.e. :C4.

  (chord :c4 :major)  ; c major           -> #{60 64 67}
  (chord :a4 :minor)  ; a minor           -> #{57 60 64}
  (chord :Bb4 :dim)   ; b flat diminished -> #{70 73 76}
  "
  ([root chord-name]
   (chord root chord-name 0))
  ([root chord-name inversion]
     (let [root (note root)
           chord (resolve-chord chord-name)
           notes (map #(+ % root) chord)]
       (invert-chord notes inversion))))
#+end_example

