src/post_tonal_overtone/org_files/html-versions/build-voice-leading-engine.html



<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">2.2.2</span> background libraries</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
What about libraries of functions that you might want to use? What
kind of namespace-qualification are you going to have to use? Will you
need to <code>use</code> anything directly?
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #7CB8BB;">finite-prob</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>certainly 11)
</pre>
</div>

<p>
Take a look at some of the vars defined in other namespaces. Do you
know what they are, or how to use them? 
</p>

<p>
How far should you go with trying to document what you're using?
Personally, I like to err on the side of overly comprehensive, which
working with emacs and org-mode makes possible and not excessively
distracting.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">post_tonal_overtone.probability_functions.finite-distributions</span>)
</pre>
</div>

<p>
Note, during all this loading and checking, you may have received
mysterious errors. Have you checked your REPL lately? There may be
subtle spelling or procedural mistakes that you have made which you
will want to "debug" from the sometimes obscure error messages you
receive.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">3</span> check basic sounds and levels</h2>
<div class="outline-text-2" id="text-3">
<p>
This is akin to what happens at live shows, where the musician's and
sound engineers do "sound checks" (or really "line checks," in the
case of just making sure everything is working).
</p>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.1</span> sin wave</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">3.1.1</span> basic</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(demo (sin-osc))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">3.1.2</span> louder</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">

<pre class="src src-clojure">(demo  (out 0 (* 2 (sin-osc))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.2</span> white noise</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-clojure">(demo (white-noise))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.3</span> loaded samples</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">3.3.1</span> piano</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">

<pre class="src src-clojure">(sampled-piano)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(sampled-piano (note <span style="color: #BFEBBF;">:A4</span>))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline43" class="outline-2">
<h2 id="orgheadline43"><span class="section-number-2">4</span> construct meaningful musical units</h2>
<div class="outline-text-2" id="text-4">
<p>
In all the tutorials so far we have used the <code>doseq</code> function. Here it
is again, taken out of context and with some imagined function body
after the initial binding form.
</p>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">4.1</span> all-important idiom for playing a chord</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note a-chord] <span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">pseudocode (player-function note))</span>
</pre>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">4.1.1</span> simple middle C triad</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
So begin to note how the <code>doseq</code> function does what it does, which is
especially useful to us when we are interested in doing something
repetitive like playing all the notes in a chord.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">play-piano-chord</span> [a-chord]
        (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note a-chord] (sampled-piano note)))

(play-piano-chord [60 64 67])
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">4.1.2</span> randomly voice an A7 flat9 sharp13, play chord as side-effect</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
So, with that reminder of how we can tidily play chords, we can now
look a little more deeply at some techniques for accessing and
rendering chords as built in to overtone.
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline19"></a>4 note voicings using built-in overtone functionality<br  /><div class="outline-text-5" id="text-4-1-2-1">
<p>
In the last tutorial, I spent most of my time dealing with the kinds
of harmonies that characterize post-tonal music. Overtone, however,
has ample support for the harmonic organization that typifies tonal
music, that is the chords and scales of Western (and some non-Western)
music. 
</p>

<p>
Without going into too much of a digression on the sometimes
overly-casual distinctions between tonal, post-tonal and "centric"
music, let's just look at (and listen to) a quick cool bit of
functionality.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">overtone.live/rand-chord</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">([root chord-name num-pitches pitch-range])</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">Generates a random list of MIDI notes with cardinality num-pitches</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">bound within the range of the specified root and pitch-range and</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">only containing pitches within the specified chord-name. Similar to</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">Impromptu's pc:make-chord</span>

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">mod12</span> [n] (mod n 12))

(<span style="color: #F0DFAF; font-weight: bold;">let</span> [midis (rand-chord <span style="color: #BFEBBF;">:A2</span> <span style="color: #BFEBBF;">:7+5-9</span> 4 48)]
(<span style="color: #F0DFAF; font-weight: bold;">do</span> (println (map find-note-name midis))
    (println midis)
    (println (map mod12 midis))
    (play-piano-chord midis)
  ))
</pre>
</div>

<p>
Overtone supplies a rich set of built-in keyword args for dealing with
a system of naming chords that is common to jazz and 20th century
popular music: a mix of names and Arabic numberal, with a few odd
other symbols thrown in there.
</p>

<p>
Consulting the overtone documentation for chord only gives a small
picture of what actually is available when we crack open the overtone
<code>pitch.clj</code> source file.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(source chord)
</pre>
</div>
</div></li>
