src/post_tonal_overtone/org_files/html-versions/build-voice-leading-engine.html

<li><a id="orgheadline20"></a>pitch.clj source<br  /><div class="outline-text-5" id="text-4-1-2-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">ns</span> ^{<span style="color: #BFEBBF;">:doc</span> <span style="color: #CC9393;">"Functions to help generate and manipulate frequencies and</span>
<span style="color: #CC9393;">    sets of related frequencies. This is the place for functions</span>
<span style="color: #CC9393;">    representing general musical knowledge, like scales, chords,</span>
<span style="color: #CC9393;">    intervals, etc."</span>
      <span style="color: #BFEBBF;">:author</span> <span style="color: #CC9393;">"Jeff Rose, Sam Aaron &amp; Marius Kempe"</span>}
  <span style="color: #7CB8BB;">overtone.music.pitch</span>
  (<span style="color: #BFEBBF;">:use</span> [<span style="color: #7CB8BB;">overtone.helpers</span> old-contrib]
        [<span style="color: #7CB8BB;">overtone.helpers.map</span> <span style="color: #BFEBBF;">:only</span> [reverse-get]]
        [<span style="color: #7CB8BB;">overtone.algo</span> chance])
  (<span style="color: #BFEBBF;">:require</span> [<span style="color: #7CB8BB;">clojure.string</span> <span style="color: #BFEBBF;">:as</span> string]))

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Notes in a typical scale are related by small, prime number ratios. Of all</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">possible 7 note scales, the major scale has the highest number of consonant</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">intervals.</span>

(<span style="color: #F0DFAF; font-weight: bold;">defmacro</span> <span style="color: #93E0E3;">defratio</span> [rname ratio]
  `(<span style="color: #F0DFAF; font-weight: bold;">defn</span> ~rname [freq#] (* freq# ~ratio)))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Perfect consonance</span>
(<span style="color: #F0DFAF; font-weight: bold;">defratio</span> <span style="color: #93E0E3;">unison</span>    1/1)
(<span style="color: #F0DFAF; font-weight: bold;">defratio</span> <span style="color: #93E0E3;">octave</span>    2/1)
(<span style="color: #F0DFAF; font-weight: bold;">defratio</span> <span style="color: #93E0E3;">fifth</span>     3/2)

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Imperfect consonance</span>
(<span style="color: #F0DFAF; font-weight: bold;">defratio</span> <span style="color: #93E0E3;">sixth</span>     5/3)
(<span style="color: #F0DFAF; font-weight: bold;">defratio</span> <span style="color: #93E0E3;">third</span>     5/4)

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Dissonance</span>
(<span style="color: #F0DFAF; font-weight: bold;">defratio</span> <span style="color: #93E0E3;">fourth</span>    4/3)
(<span style="color: #F0DFAF; font-weight: bold;">defratio</span> <span style="color: #93E0E3;">min-third</span> 6/5)
(<span style="color: #F0DFAF; font-weight: bold;">defratio</span> <span style="color: #93E0E3;">min-sixth</span> 8/5)

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">cents</span>
  <span style="color: #9FC59F;">"Returns a frequency computed by adding n-cents to freq.  A cent is</span>
<span style="color: #9FC59F;">  a logarithmic measurement of pitch, where 1-octave equals 1200</span>
<span style="color: #9FC59F;">  cents."</span>
  [freq n-cents]
  (* freq (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>pow 2 (/ n-cents 1200))))

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">MIDI</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">MIDI-RANGE</span> (range 128))
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">MIDDLE-C</span> 60)

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Manipulating pitch using midi note numbers</span>

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">shift</span>
  <span style="color: #9FC59F;">"Shift the 'notes' in 'phrase' by a given 'amount' of half-steps."</span>
  [phrase notes amount]
  (<span style="color: #F0DFAF; font-weight: bold;">if</span> notes
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (first notes)
          shifted (+ (get phrase note) amount)]
      (<span style="color: #F0DFAF; font-weight: bold;">recur</span> (assoc phrase note shifted) (next notes) amount))
    phrase))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">flat</span>
  <span style="color: #9FC59F;">"Flatten the specified notes in the phrase."</span>
  [phrase notes]
  (shift phrase notes -1))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">sharp</span>
  <span style="color: #9FC59F;">"Sharpen the specified notes in the phrase."</span>
  [phrase notes]
  (shift phrase notes +1))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">invert</span>
  <span style="color: #9FC59F;">"Invert a sequence of notes using either the first note as the</span>
<span style="color: #9FC59F;">  stationary pivot point or the optional second argument."</span>
  [notes &amp; [pivot]]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [pivot (<span style="color: #F0DFAF; font-weight: bold;">or</span> pivot (first notes))]
    (<span style="color: #F0DFAF; font-weight: bold;">for</span> [n notes] (- pivot (- n pivot)))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">octave-note</span>
  <span style="color: #9FC59F;">"Convert an octave and interval to a midi note."</span>
  [octave interval]
  (+ (* octave 12) interval 12))

(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">NOTES</span> {<span style="color: #BFEBBF;">:C</span>  0  <span style="color: #BFEBBF;">:c</span>  0  <span style="color: #BFEBBF;">:b#</span> 0  <span style="color: #BFEBBF;">:B#</span> 0
            <span style="color: #BFEBBF;">:C#</span> 1  <span style="color: #BFEBBF;">:c#</span> 1  <span style="color: #BFEBBF;">:Db</span> 1  <span style="color: #BFEBBF;">:db</span> 1  <span style="color: #BFEBBF;">:DB</span> 1  <span style="color: #BFEBBF;">:dB</span> 1
            <span style="color: #BFEBBF;">:D</span>  2  <span style="color: #BFEBBF;">:d</span>  2
            <span style="color: #BFEBBF;">:D#</span> 3  <span style="color: #BFEBBF;">:d#</span> 3  <span style="color: #BFEBBF;">:Eb</span> 3  <span style="color: #BFEBBF;">:eb</span> 3  <span style="color: #BFEBBF;">:EB</span> 3  <span style="color: #BFEBBF;">:eB</span> 3
            <span style="color: #BFEBBF;">:E</span>  4  <span style="color: #BFEBBF;">:e</span>  4
            <span style="color: #BFEBBF;">:E#</span> 5  <span style="color: #BFEBBF;">:e#</span> 5  <span style="color: #BFEBBF;">:F</span>  5  <span style="color: #BFEBBF;">:f</span>  5
            <span style="color: #BFEBBF;">:F#</span> 6  <span style="color: #BFEBBF;">:f#</span> 6  <span style="color: #BFEBBF;">:Gb</span> 6  <span style="color: #BFEBBF;">:gb</span> 6  <span style="color: #BFEBBF;">:GB</span> 6  <span style="color: #BFEBBF;">:gB</span> 6
            <span style="color: #BFEBBF;">:G</span>  7  <span style="color: #BFEBBF;">:g</span>  7
            <span style="color: #BFEBBF;">:G#</span> 8  <span style="color: #BFEBBF;">:g#</span> 8  <span style="color: #BFEBBF;">:Ab</span> 8  <span style="color: #BFEBBF;">:ab</span> 8  <span style="color: #BFEBBF;">:AB</span> 8  <span style="color: #BFEBBF;">:aB</span> 8
            <span style="color: #BFEBBF;">:A</span>  9  <span style="color: #BFEBBF;">:a</span>  9
            <span style="color: #BFEBBF;">:A#</span> 10 <span style="color: #BFEBBF;">:a#</span> 10 <span style="color: #BFEBBF;">:Bb</span> 10 <span style="color: #BFEBBF;">:bb</span> 10 <span style="color: #BFEBBF;">:BB</span> 10 <span style="color: #BFEBBF;">:bB</span> 10
            <span style="color: #BFEBBF;">:B</span>  11 <span style="color: #BFEBBF;">:b</span>  11 <span style="color: #BFEBBF;">:Cb</span> 11 <span style="color: #BFEBBF;">:cb</span> 11 <span style="color: #BFEBBF;">:CB</span> 11 <span style="color: #BFEBBF;">:cB</span> 11})

(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">REVERSE-NOTES</span>
  {0 <span style="color: #BFEBBF;">:C</span>
   1 <span style="color: #BFEBBF;">:C#</span>
   2 <span style="color: #BFEBBF;">:D</span>
   3 <span style="color: #BFEBBF;">:Eb</span>
   4 <span style="color: #BFEBBF;">:E</span>
   5 <span style="color: #BFEBBF;">:F</span>
   6 <span style="color: #BFEBBF;">:F#</span>
   7 <span style="color: #BFEBBF;">:G</span>
   8 <span style="color: #BFEBBF;">:Ab</span>
   9 <span style="color: #BFEBBF;">:A</span>
   10 <span style="color: #BFEBBF;">:Bb</span>
   11 <span style="color: #BFEBBF;">:B</span>})

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">canonical-pitch-class-name</span>
  <span style="color: #9FC59F;">"Returns the canonical version of the specified pitch class pc."</span>
  [pc]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [pc (keyword (name pc))]
      (REVERSE-NOTES (<span style="color: #BFEBBF;">NOTES</span> pc))))

(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">MIDI-NOTE-RE-STR</span> <span style="color: #9FC59F;">"([a-gA-G][#bB]?)([-0-9]+)"</span> )
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">MIDI-NOTE-RE</span> (re-pattern MIDI-NOTE-RE-STR))
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">ONLY-MIDI-NOTE-RE</span> (re-pattern (str <span style="color: #CC9393;">"</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393;">A"</span> MIDI-NOTE-RE-STR <span style="color: #CC9393;">"</span><span style="color: #CC9393; font-weight: bold;">\\</span><span style="color: #CC9393;">Z"</span>)))

(<span style="color: #F0DFAF; font-weight: bold;">defn-</span> <span style="color: #93E0E3;">midi-string-matcher</span>
  <span style="color: #9FC59F;">"Determines whether a midi keyword is valid or not. If valid,</span>
<span style="color: #9FC59F;">  returns a regexp match object"</span>
  [mk]
  (re-find ONLY-MIDI-NOTE-RE (name mk)))

(<span style="color: #F0DFAF; font-weight: bold;">defn-</span> <span style="color: #93E0E3;">validate-midi-string!</span>
  <span style="color: #9FC59F;">"Throws a friendly exception if midi-keyword mk is not</span>
<span style="color: #9FC59F;">  valid. Returns matches if valid."</span>
  [mk]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [matches (midi-string-matcher mk)]
    (<span style="color: #F0DFAF; font-weight: bold;">when-not</span> matches
      (<span style="color: #F0DFAF; font-weight: bold;">throw</span> (<span style="color: #7CB8BB;">IllegalArgumentException.</span>
              (str <span style="color: #CC9393;">"Invalid midi-string. "</span> mk
                   <span style="color: #CC9393;">" does not appear to be in MIDI format i.e. C#4"</span>))))

    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [[match pictch-class octave] matches]
      (<span style="color: #F0DFAF; font-weight: bold;">when</span> (&lt; (<span style="color: #7CB8BB;">Integer.</span> octave) -1)
        (<span style="color: #F0DFAF; font-weight: bold;">throw</span> (<span style="color: #7CB8BB;">IllegalArgumentException.</span>
                (str <span style="color: #CC9393;">"Invalid midi-string: "</span> mk
                     <span style="color: #CC9393;">". Octave is out of range. Lowest octave value is -1"</span>)))))
    matches))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">note-info</span>
  <span style="color: #9FC59F;">"Takes a string representing a midi note such as C4 and returns a map</span>
<span style="color: #9FC59F;">  of note info"</span>
  [midi-string]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [[match pitch-class octave] (validate-midi-string! midi-string)
        pitch-class                (canonical-pitch-class-name pitch-class)
        octave                     (<span style="color: #7CB8BB;">Integer.</span> octave)
        interval                   (<span style="color: #BFEBBF;">NOTES</span> (keyword pitch-class))]
    {<span style="color: #BFEBBF;">:match</span>       match
     <span style="color: #BFEBBF;">:pitch-class</span> pitch-class
     <span style="color: #BFEBBF;">:octave</span>      (<span style="color: #7CB8BB;">Integer.</span> octave)
     <span style="color: #BFEBBF;">:interval</span>    interval
     <span style="color: #BFEBBF;">:midi-note</span>   (octave-note octave interval)}))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">mk-midi-string</span>
  <span style="color: #9FC59F;">"Takes a string or keyword representing a pitch and a number</span>
<span style="color: #9FC59F;">  representing an integer and returns a new string which is a</span>
<span style="color: #9FC59F;">  concatanation of the two. Throws an error if the resulting midi</span>
<span style="color: #9FC59F;">  string is invalid.</span>

<span style="color: #9FC59F;">  (midi-string </span><span style="color: #BFEBBF;">:F</span><span style="color: #9FC59F;"> 7)  ;=&gt; \"F7\"</span>
<span style="color: #9FC59F;">  (midi-string </span><span style="color: #BFEBBF;">:Eb</span><span style="color: #9FC59F;"> 3) ;=&gt; \"Eb3\""</span>
  [pitch-key octave]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [res (str (name pitch-key) octave)]
    (validate-midi-string! res)
    res))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">note</span>
  <span style="color: #9FC59F;">"Resolves note to MIDI number format. Resolves upper and lower-case</span>
<span style="color: #9FC59F;">  keywords and strings in MIDI note format. If given an integer or</span>
<span style="color: #9FC59F;">  nil, returns them unmodified. All other inputs will raise an</span>
<span style="color: #9FC59F;">  exception.</span>

<span style="color: #9FC59F;">  Usage examples:</span>

<span style="color: #9FC59F;">  (note \"C4\")  ;=&gt; 60</span>
<span style="color: #9FC59F;">  (note \"C#4\") ;=&gt; 61</span>
<span style="color: #9FC59F;">  (note \"eb2\") ;=&gt; 39</span>
<span style="color: #9FC59F;">  (note </span><span style="color: #BFEBBF;">:F#7</span><span style="color: #9FC59F;">)    ;=&gt; 102</span>
<span style="color: #9FC59F;">  (note </span><span style="color: #BFEBBF;">:db5</span><span style="color: #9FC59F;">)    ;=&gt; 73</span>
<span style="color: #9FC59F;">  (note 60)      ;=&gt; 60</span>
<span style="color: #9FC59F;">  (note nil)     ;=&gt; nil"</span>
  [n]
  (<span style="color: #F0DFAF; font-weight: bold;">cond</span>
    (nil? n) <span style="color: #BFEBBF;">nil</span>
    (integer? n) (<span style="color: #F0DFAF; font-weight: bold;">if</span> (&gt;= n 0)
                   n
                   (<span style="color: #F0DFAF; font-weight: bold;">throw</span> (<span style="color: #7CB8BB;">IllegalArgumentException.</span>
                           (str <span style="color: #CC9393;">"Unable to resolve note: "</span>
                                n
                                <span style="color: #CC9393;">". Value is out of range. Lowest value is 0"</span>))))
    (keyword? n) (note (name n))
    (string? n) (<span style="color: #BFEBBF;">:midi-note</span> (note-info n))
    <span style="color: #BFEBBF;">:else</span> (<span style="color: #F0DFAF; font-weight: bold;">throw</span> (<span style="color: #7CB8BB;">IllegalArgumentException.</span> (str <span style="color: #CC9393;">"Unable to resolve note: "</span> n <span style="color: #CC9393;">". Wasn't a recognised format (either an integer, keyword, string or nil)"</span>)))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">match-note</span>
  <span style="color: #9FC59F;">"Returns the first midi-note formatted substring in s. If passed</span>
<span style="color: #9FC59F;">   optional prev and pos strings will use them to generate positive</span>
<span style="color: #9FC59F;">   look ahead and behind matchers. "</span>
  ([s] (match-note s <span style="color: #CC9393;">""</span> <span style="color: #CC9393;">""</span>))
  ([s prev-str post-str]
     (<span style="color: #F0DFAF; font-weight: bold;">let</span> [look-behind (<span style="color: #F0DFAF; font-weight: bold;">if</span> prev-str (str <span style="color: #CC9393;">"(?&lt;="</span> prev-str <span style="color: #CC9393;">")"</span>) <span style="color: #CC9393;">""</span>)
           look-ahead  (<span style="color: #F0DFAF; font-weight: bold;">if</span> post-str (str <span style="color: #CC9393;">"(?="</span> post-str <span style="color: #CC9393;">")"</span>) <span style="color: #CC9393;">""</span>)
           match       (re-find (re-pattern (str look-behind MIDI-NOTE-RE-STR look-ahead)) s)]
       (<span style="color: #F0DFAF; font-weight: bold;">when</span> match
         (<span style="color: #F0DFAF; font-weight: bold;">let</span> [[match pitch-class octave] match]
           (note-info match))))))



<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">* Each note in a scale acts as either a generator or a collector of other notes,</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">depending on their relations in time within a sequence.</span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">- How can this concept be developed into parameterized sequences with knobs for</span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">adjusting things like tension, dissonance, swing, genre (latin, asian, arabic...)</span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">- Can we develop a symbol language or visual representation so that someone could compose</span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">a piece by using mood tokens rather than specifying scales and notes directly?  Basically,</span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">generator functions would have to choose the scales, chords, notes and rhythm based on</span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">a mix of looking up aspects of the mood, and informed randomness.</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Use a note (</span><span style="color: #BFEBBF;">:C</span><span style="color: #7F9F7F;"> scale) or (</span><span style="color: #BFEBBF;">:Eb</span><span style="color: #7F9F7F;"> scale)</span>

<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">You may be interested to know that each of the seven degrees of the diatonic scale has its own name:</span>
<span style="color: #5F7F5F;">;;</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">1 (do)  tonic</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">2 (re)  supertonic</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">3 (mi)  mediant</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">4 (fa)  subdominant</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">5 (sol) dominant</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">6 (la)  submediant/superdominant</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">7 (ti)  subtonic"</span>


<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Various scale intervals in terms of steps on a piano, or midi note numbers</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">All sequences should add up to 12 - the number of semitones in an octave</span>

(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">SCALE</span>
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [ionian-sequence     [2 2 1 2 2 2 1]
        hex-sequence        [2 2 1 2 2 3]
        pentatonic-sequence [3 2 2 3 2]
        rotate (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [scale-sequence offset]
                 (take (count scale-sequence)
                       (drop offset (cycle scale-sequence))))]
    {<span style="color: #BFEBBF;">:diatonic</span>           ionian-sequence
     <span style="color: #BFEBBF;">:ionian</span>             (rotate ionian-sequence 0)
     <span style="color: #BFEBBF;">:major</span>              (rotate ionian-sequence 0)
     <span style="color: #BFEBBF;">:dorian</span>             (rotate ionian-sequence 1)
     <span style="color: #BFEBBF;">:phrygian</span>           (rotate ionian-sequence 2)
     <span style="color: #BFEBBF;">:lydian</span>             (rotate ionian-sequence 3)
     <span style="color: #BFEBBF;">:mixolydian</span>         (rotate ionian-sequence 4)
     <span style="color: #BFEBBF;">:aeolian</span>            (rotate ionian-sequence 5)
     <span style="color: #BFEBBF;">:minor</span>              (rotate ionian-sequence 5)
     <span style="color: #BFEBBF;">:locrian</span>            (rotate ionian-sequence 6)
     <span style="color: #BFEBBF;">:hex-major6</span>         (rotate hex-sequence 0)
     <span style="color: #BFEBBF;">:hex-dorian</span>         (rotate hex-sequence 1)
     <span style="color: #BFEBBF;">:hex-phrygian</span>       (rotate hex-sequence 2)
     <span style="color: #BFEBBF;">:hex-major7</span>         (rotate hex-sequence 3)
     <span style="color: #BFEBBF;">:hex-sus</span>            (rotate hex-sequence 4)
     <span style="color: #BFEBBF;">:hex-aeolian</span>        (rotate hex-sequence 5)
     <span style="color: #BFEBBF;">:minor-pentatonic</span>   (rotate pentatonic-sequence 0)
     <span style="color: #BFEBBF;">:yu</span>                 (rotate pentatonic-sequence 0)
     <span style="color: #BFEBBF;">:major-pentatonic</span>   (rotate pentatonic-sequence 1)
     <span style="color: #BFEBBF;">:gong</span>               (rotate pentatonic-sequence 1)
     <span style="color: #BFEBBF;">:egyptian</span>           (rotate pentatonic-sequence 2)
     <span style="color: #BFEBBF;">:shang</span>              (rotate pentatonic-sequence 2)
     <span style="color: #BFEBBF;">:jiao</span>               (rotate pentatonic-sequence 3)
     <span style="color: #BFEBBF;">:pentatonic</span>         (rotate pentatonic-sequence 4) <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">historical match</span>
     <span style="color: #BFEBBF;">:zhi</span>                (rotate pentatonic-sequence 4)
     <span style="color: #BFEBBF;">:ritusen</span>            (rotate pentatonic-sequence 4)
     <span style="color: #BFEBBF;">:whole-tone</span>         [2 2 2 2 2 2]
     <span style="color: #BFEBBF;">:whole</span>              [2 2 2 2 2 2]
     <span style="color: #BFEBBF;">:chromatic</span>          [1 1 1 1 1 1 1 1 1 1 1 1]
     <span style="color: #BFEBBF;">:harmonic-minor</span>     [2 1 2 2 1 3 1]
     <span style="color: #BFEBBF;">:melodic-minor-asc</span>  [2 1 2 2 2 2 1]
     <span style="color: #BFEBBF;">:hungarian-minor</span>    [2 1 3 1 1 3 1]
     <span style="color: #BFEBBF;">:octatonic</span>          [2 1 2 1 2 1 2 1]
     <span style="color: #BFEBBF;">:messiaen1</span>          [2 2 2 2 2 2]
     <span style="color: #BFEBBF;">:messiaen2</span>          [1 2 1 2 1 2 1 2]
     <span style="color: #BFEBBF;">:messiaen3</span>          [2 1 1 2 1 1 2 1 1]
     <span style="color: #BFEBBF;">:messiaen4</span>          [1 1 3 1 1 1 3 1]
     <span style="color: #BFEBBF;">:messiaen5</span>          [1 4 1 1 4 1]
     <span style="color: #BFEBBF;">:messiaen6</span>          [2 2 1 1 2 2 1 1]
     <span style="color: #BFEBBF;">:messiaen7</span>          [1 1 1 2 1 1 1 1 2 1]
     <span style="color: #BFEBBF;">:super-locrian</span>      [1 2 1 2 2 2 2]
     <span style="color: #BFEBBF;">:hirajoshi</span>          [2 1 4 1 4]
     <span style="color: #BFEBBF;">:kumoi</span>              [2 1 4 2 3]
     <span style="color: #BFEBBF;">:neapolitan-major</span>   [1 2 2 2 2 2 1]
     <span style="color: #BFEBBF;">:bartok</span>             [2 2 1 2 1 2 2]
     <span style="color: #BFEBBF;">:bhairav</span>            [1 3 1 2 1 3 1]
     <span style="color: #BFEBBF;">:locrian-major</span>      [2 2 1 1 2 2 2]
     <span style="color: #BFEBBF;">:ahirbhairav</span>        [1 3 1 2 2 1 2]
     <span style="color: #BFEBBF;">:enigmatic</span>          [1 3 2 2 2 1 1]
     <span style="color: #BFEBBF;">:neapolitan-minor</span>   [1 2 2 2 1 3 1]
     <span style="color: #BFEBBF;">:pelog</span>              [1 2 4 1 4]
     <span style="color: #BFEBBF;">:augmented2</span>         [1 3 1 3 1 3]
     <span style="color: #BFEBBF;">:scriabin</span>           [1 3 3 2 3]
     <span style="color: #BFEBBF;">:harmonic-major</span>     [2 2 1 2 1 3 1]
     <span style="color: #BFEBBF;">:melodic-minor-desc</span> [2 1 2 2 1 2 2]
     <span style="color: #BFEBBF;">:romanian-minor</span>     [2 1 3 1 2 1 2]
     <span style="color: #BFEBBF;">:hindu</span>              [2 2 1 2 1 2 2]
     <span style="color: #BFEBBF;">:iwato</span>              [1 4 1 4 2]
     <span style="color: #BFEBBF;">:melodic-minor</span>      [2 1 2 2 2 2 1]
     <span style="color: #BFEBBF;">:diminished2</span>        [2 1 2 1 2 1 2 1]
     <span style="color: #BFEBBF;">:marva</span>              [1 3 2 1 2 2 1]
     <span style="color: #BFEBBF;">:melodic-major</span>      [2 2 1 2 1 2 2]
     <span style="color: #BFEBBF;">:indian</span>             [4 1 2 3 2]
     <span style="color: #BFEBBF;">:spanish</span>            [1 3 1 2 1 2 2]
     <span style="color: #BFEBBF;">:prometheus</span>         [2 2 2 5 1]
     <span style="color: #BFEBBF;">:diminished</span>         [1 2 1 2 1 2 1 2]
     <span style="color: #BFEBBF;">:todi</span>               [1 2 3 1 1 3 1]
     <span style="color: #BFEBBF;">:leading-whole</span>      [2 2 2 2 2 1 1]
     <span style="color: #BFEBBF;">:augmented</span>          [3 1 3 1 3 1]
     <span style="color: #BFEBBF;">:purvi</span>              [1 3 2 1 1 3 1]
     <span style="color: #BFEBBF;">:chinese</span>            [4 2 1 4 1]
     <span style="color: #BFEBBF;">:lydian-minor</span>       [2 2 2 1 1 2 2]}))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">resolve-scale</span>
  <span style="color: #9FC59F;">"Either looks the scale up in the map of SCALEs if it's a keyword or</span>
<span style="color: #9FC59F;">  simply returns it unnmodified. Allows users to specify a scale</span>
<span style="color: #9FC59F;">  either as a seq such as [2 2 1 2 2 2 1] or by keyword such</span>
<span style="color: #9FC59F;">  as </span><span style="color: #BFEBBF;">:aeolian</span><span style="color: #9FC59F;">"</span>
  [scale]
  (<span style="color: #F0DFAF; font-weight: bold;">if</span> (keyword? scale)
    (<span style="color: #BFEBBF;">SCALE</span> scale)
    scale))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">scale-field</span>
  <span style="color: #9FC59F;">"Create the note field for a given scale.  Scales are specified with</span>
<span style="color: #9FC59F;">  a keyword representing the key and an optional scale</span>
<span style="color: #9FC59F;">  name (defaulting to </span><span style="color: #BFEBBF;">:major</span><span style="color: #9FC59F;">):</span>
<span style="color: #9FC59F;">  (scale-field </span><span style="color: #BFEBBF;">:g</span><span style="color: #9FC59F;">)</span>
<span style="color: #9FC59F;">  (scale-field </span><span style="color: #BFEBBF;">:g</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:minor</span><span style="color: #9FC59F;">)"</span>
  [skey &amp; [sname]]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [base (<span style="color: #BFEBBF;">NOTES</span> skey)
        sname (<span style="color: #F0DFAF; font-weight: bold;">or</span> sname <span style="color: #BFEBBF;">:major</span>)
        intervals (<span style="color: #BFEBBF;">SCALE</span> sname)]
    (reverse (next
      (reduce (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [mem interval]
              (<span style="color: #F0DFAF; font-weight: bold;">let</span> [new-note (+ (first mem) interval)]
                (conj mem new-note)))
            (list base)
            (take (* 8 12) (cycle intervals)))))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">nth-interval</span>
  <span style="color: #9FC59F;">"Return the count of semitones for the nth degree from the start of</span>
<span style="color: #9FC59F;">  the diatonic scale in the specific mode (or ionian/major by</span>
<span style="color: #9FC59F;">  default).</span>

<span style="color: #9FC59F;">  i.e. the ionian/major scale has an interval sequence of 2 2 1 2 2 2</span>
<span style="color: #9FC59F;">       1 therefore the 4th degree is (+ 2 2 1 2) semitones from the</span>
<span style="color: #9FC59F;">       start of the scale."</span>
  ([n] (nth-interval <span style="color: #BFEBBF;">:diatonic</span> n))
  ([scale n]
     (reduce + (take n (cycle (scale <span style="color: #BFEBBF;">SCALE</span>))))))

(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">DEGREE</span> {<span style="color: #BFEBBF;">:i</span>     1
             <span style="color: #BFEBBF;">:ii</span>    2
             <span style="color: #BFEBBF;">:iii</span>   3
             <span style="color: #BFEBBF;">:iv</span>    4
             <span style="color: #BFEBBF;">:v</span>     5
             <span style="color: #BFEBBF;">:vi</span>    6
             <span style="color: #BFEBBF;">:vii</span>   7
             <span style="color: #BFEBBF;">:_</span>     <span style="color: #BFEBBF;">nil</span>})

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">degree-&gt;int</span>
  [degree]
  (<span style="color: #F0DFAF; font-weight: bold;">if</span> (some #{degree} (keys <span style="color: #BFEBBF;">DEGREE</span>))
    (degree <span style="color: #BFEBBF;">DEGREE</span>)
    (<span style="color: #F0DFAF; font-weight: bold;">throw</span> (<span style="color: #7CB8BB;">IllegalArgumentException.</span> (str <span style="color: #CC9393;">"Unable to resolve degree: "</span> degree <span style="color: #CC9393;">". Was expecting a roman numeral in the range </span><span style="color: #BFEBBF;">:i</span><span style="color: #CC9393;"> -&gt; </span><span style="color: #BFEBBF;">:vii</span><span style="color: #CC9393;"> or the nil-note symbol </span><span style="color: #BFEBBF;">:_</span><span style="color: #CC9393;">"</span>)))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">resolve-degree</span>
  <span style="color: #9FC59F;">"returns a map representing the degree, and the octave semitone</span>
<span style="color: #9FC59F;">  shift (i.e. sharp flat)"</span>
  ([degree] (resolve-degree degree 0 0))
  ([degree octave-shift semitone-shift]
     (<span style="color: #F0DFAF; font-weight: bold;">cond</span>
      (<span style="color: #94BFF3;">.endsWith</span> (name degree) <span style="color: #CC9393;">"-"</span>)
      (resolve-degree (keyword (chop (name degree))) (dec octave-shift) semitone-shift)

      (<span style="color: #94BFF3;">.endsWith</span> (name degree) <span style="color: #CC9393;">"+"</span>)
      (resolve-degree (keyword (chop (name degree))) (inc octave-shift) semitone-shift)

      (<span style="color: #94BFF3;">.endsWith</span> (name degree) <span style="color: #CC9393;">"b"</span>)
      (resolve-degree (keyword (chop (name degree))) octave-shift (dec semitone-shift))

      (<span style="color: #94BFF3;">.endsWith</span> (name degree) <span style="color: #CC9393;">"#"</span>)
      (resolve-degree (keyword (chop (name degree))) octave-shift (inc semitone-shift))

      <span style="color: #BFEBBF;">:default</span>
      (<span style="color: #F0DFAF; font-weight: bold;">let</span> [degree (degree-&gt;int degree)]
        {<span style="color: #BFEBBF;">:degree</span> degree
         <span style="color: #BFEBBF;">:octave-shift</span> octave-shift
         <span style="color: #BFEBBF;">:semitone-shift</span> semitone-shift}))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">degree-&gt;interval</span>
  <span style="color: #9FC59F;">"Converts the degree of a scale given as a roman numeral keyword and</span>
<span style="color: #9FC59F;">  converts it to the number of semitones from the tonic of</span>
<span style="color: #9FC59F;">  the specified scale.</span>

<span style="color: #9FC59F;">  (degree-&gt;interval </span><span style="color: #BFEBBF;">:ii</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:major</span><span style="color: #9FC59F;">) ;=&gt; 2</span>

<span style="color: #9FC59F;">  Trailing #, b, + - represent sharps, flats, octaves up and down</span>
<span style="color: #9FC59F;">  respectively.  An arbitrary number may be added in any order."</span>
  [degree scale]
  (<span style="color: #F0DFAF; font-weight: bold;">cond</span>
    (nil? degree) <span style="color: #BFEBBF;">nil</span>
    (= <span style="color: #BFEBBF;">:_</span> degree) <span style="color: #BFEBBF;">nil</span>

    (number? degree) (nth-interval scale (dec degree))

    (keyword? degree) (<span style="color: #F0DFAF; font-weight: bold;">let</span> [degree     (resolve-degree degree)
                            interval   (nth-interval scale (dec (<span style="color: #BFEBBF;">:degree</span> degree)))
                            oct-shift  (* 12 (<span style="color: #BFEBBF;">:octave-shift</span> degree))
                            semi-shift (<span style="color: #BFEBBF;">:semitone-shift</span> degree)]
                        (+ interval oct-shift semi-shift))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">degrees-&gt;pitches</span>
  <span style="color: #9FC59F;">"Convert intervals to pitches in MIDI number format.  Supports</span>
<span style="color: #9FC59F;">  nested collections."</span>
  [degrees scale root]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [root (note root)]
    (<span style="color: #F0DFAF; font-weight: bold;">when</span> (nil? root)
      (<span style="color: #F0DFAF; font-weight: bold;">throw</span> (<span style="color: #7CB8BB;">IllegalArgumentException.</span> (str <span style="color: #CC9393;">"root resolved to a nil value. degrees-&gt;pitches requires a non-nil root."</span>))))
    (map (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [degree]
           (<span style="color: #F0DFAF; font-weight: bold;">cond</span>
            (coll? degree) (degrees-&gt;pitches degree scale root)
            (nil? degree) <span style="color: #BFEBBF;">nil</span>
            <span style="color: #BFEBBF;">:default</span> (<span style="color: #F0DFAF; font-weight: bold;">if-let</span> [interval (degree-&gt;interval degree scale)]
                       (+ root interval))))
         degrees)))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">resolve-degrees</span>
  <span style="color: #9FC59F;">"Either maps the degrees to integers if they're keywords using the map DEGREE</span>
<span style="color: #9FC59F;">  or leaves them unmodified"</span>
  [degrees]
  (map #(<span style="color: #F0DFAF; font-weight: bold;">if</span> (keyword? <span style="color: #DFAF8F;">%</span>) (<span style="color: #BFEBBF;">DEGREE</span> <span style="color: #DFAF8F;">%</span>) <span style="color: #DFAF8F;">%</span>) degrees))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">scale</span>
  <span style="color: #9FC59F;">"Returns a list of notes for the specified scale. The root must be</span>
<span style="color: #9FC59F;">   in midi note format i.e. </span><span style="color: #BFEBBF;">:C4</span><span style="color: #9FC59F;"> or </span><span style="color: #BFEBBF;">:Bb4</span>


<span style="color: #9FC59F;">   (scale </span><span style="color: #BFEBBF;">:c4</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:major</span><span style="color: #9FC59F;">)  ; c major      -&gt; (60 62 64 65 67 69 71 72)</span>
<span style="color: #9FC59F;">   (scale </span><span style="color: #BFEBBF;">:Bb4</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:minor</span><span style="color: #9FC59F;">) ; b flat minor -&gt; (70 72 73 75 77 78 80 82)"</span>

  ([root scale-name] (scale root scale-name (range 1 8)))
  ([root scale-name degrees]
     (<span style="color: #F0DFAF; font-weight: bold;">let</span> [root (note root)
           degrees (resolve-degrees degrees)]
       (cons root (map #(+ root (nth-interval scale-name <span style="color: #DFAF8F;">%</span>)) degrees)))))

(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">CHORD</span>
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [major  #{0 4 7}
        minor  #{0 3 7}
        major7 #{0 4 7 11}
        dom7   #{0 4 7 10}
        minor7 #{0 3 7 10}
        aug    #{0 4 8}
        dim    #{0 3 6}
        dim7   #{0 3 6 9}]
    {<span style="color: #BFEBBF;">:1</span>         #{0}
     <span style="color: #BFEBBF;">:5</span>         #{0 7}
     <span style="color: #BFEBBF;">:+5</span>        #{0 4 8}
     <span style="color: #BFEBBF;">:m+5</span>       #{0 3 8}
     <span style="color: #BFEBBF;">:sus2</span>      #{0 2 7}
     <span style="color: #BFEBBF;">:sus4</span>      #{0 5 7}
     <span style="color: #BFEBBF;">:6</span>         #{0 4 7 9}
     <span style="color: #BFEBBF;">:m6</span>        #{0 3 7 9}
     <span style="color: #BFEBBF;">:7sus2</span>     #{0 2 7 10}
     <span style="color: #BFEBBF;">:7sus4</span>     #{0 5 7 10}
     <span style="color: #BFEBBF;">:7-5</span>       #{0 4 6 10}
     <span style="color: #BFEBBF;">:m7-5</span>      #{0 3 6 10}
     <span style="color: #BFEBBF;">:7+5</span>       #{0 4 8 10}
     <span style="color: #BFEBBF;">:m7+5</span>      #{0 3 8 10}
     <span style="color: #BFEBBF;">:9</span>         #{0 4 7 10 14}
     <span style="color: #BFEBBF;">:m9</span>        #{0 3 7 10 14}
     <span style="color: #BFEBBF;">:m7+9</span>      #{0 3 7 10 14}
     <span style="color: #BFEBBF;">:maj9</span>      #{0 4 7 11 14}
     <span style="color: #BFEBBF;">:9sus4</span>     #{0 5 7 10 14}
     <span style="color: #BFEBBF;">:6*9</span>       #{0 4 7 9 14}
     <span style="color: #BFEBBF;">:m6*9</span>      #{0 3 9 7 14}
     <span style="color: #BFEBBF;">:7-9</span>       #{0 4 7 10 13}
     <span style="color: #BFEBBF;">:m7-9</span>      #{0 3 7 10 13}
     <span style="color: #BFEBBF;">:7-10</span>      #{0 4 7 10 15}
     <span style="color: #BFEBBF;">:9+5</span>       #{0 10 13}
     <span style="color: #BFEBBF;">:m9+5</span>      #{0 10 14}
     <span style="color: #BFEBBF;">:7+5-9</span>     #{0 4 8 10 13}
     <span style="color: #BFEBBF;">:m7+5-9</span>    #{0 3 8 10 13}
     <span style="color: #BFEBBF;">:11</span>        #{0 4 7 10 14 17}
     <span style="color: #BFEBBF;">:m11</span>       #{0 3 7 10 14 17}
     <span style="color: #BFEBBF;">:maj11</span>     #{0 4 7 11 14 17}
     <span style="color: #BFEBBF;">:11+</span>       #{0 4 7 10 14 18}
     <span style="color: #BFEBBF;">:m11+</span>      #{0 3 7 10 14 18}
     <span style="color: #BFEBBF;">:13</span>        #{0 4 7 10 14 17 21}
     <span style="color: #BFEBBF;">:m13</span>       #{0 3 7 10 14 17 21}
     <span style="color: #BFEBBF;">:major</span>      major
     <span style="color: #BFEBBF;">:M</span>          major
     <span style="color: #BFEBBF;">:minor</span>      minor
     <span style="color: #BFEBBF;">:m</span>          minor
     <span style="color: #BFEBBF;">:major7</span>     major7
     <span style="color: #BFEBBF;">:dom7</span>       dom7
     <span style="color: #BFEBBF;">:7</span>          dom7
     <span style="color: #BFEBBF;">:M7</span>         major7
     <span style="color: #BFEBBF;">:minor7</span>     minor7
     <span style="color: #BFEBBF;">:m7</span>         minor7
     <span style="color: #BFEBBF;">:augmented</span>  aug
     <span style="color: #BFEBBF;">:a</span>          aug
     <span style="color: #BFEBBF;">:diminished</span> dim
     <span style="color: #BFEBBF;">:dim</span>        dim
     <span style="color: #BFEBBF;">:i</span>          dim
     <span style="color: #BFEBBF;">:diminished7</span> dim7
     <span style="color: #BFEBBF;">:dim7</span>       dim7
     <span style="color: #BFEBBF;">:i7</span>         dim7}))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">resolve-chord</span>
  <span style="color: #9FC59F;">"Either looks the chord up in the map of CHORDs if it's a keyword or</span>
<span style="color: #9FC59F;">  simply returns it unnmodified. Allows users to specify a chord</span>
<span style="color: #9FC59F;">  either with a set such as #{0 4 7} or by keyword such as </span><span style="color: #BFEBBF;">:major</span><span style="color: #9FC59F;">"</span>
  [chord]
  (<span style="color: #F0DFAF; font-weight: bold;">if</span> (keyword? chord)
    (<span style="color: #BFEBBF;">CHORD</span> chord)
    chord))

(<span style="color: #F0DFAF; font-weight: bold;">defn-</span> <span style="color: #93E0E3;">inc-first</span>
  <span style="color: #9FC59F;">"Remove the first element, increment it by n, and append to seq."</span>
  [elems n]
  (concat (next elems) [(+ n (first elems))]))

(<span style="color: #F0DFAF; font-weight: bold;">defn-</span> <span style="color: #93E0E3;">dec-last</span>
  <span style="color: #9FC59F;">"Remove the last element, decrement it by n, and prepend to seq."</span>
  [elems n]
  (concat [(- (last elems) n)] (next elems)))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">invert-chord</span>
  <span style="color: #9FC59F;">"Move a chord voicing up or down.</span>

<span style="color: #9FC59F;">    ;first inversion</span>
<span style="color: #9FC59F;">    (invert-chord [60 64 67] 1) ;=&gt; (64 67 72)</span>

<span style="color: #9FC59F;">    ; second inversion</span>
<span style="color: #9FC59F;">    (invert-chord [60 64 67] 1) ;=&gt; (67 72 76)</span>
<span style="color: #9FC59F;">  "</span>
  [notes shift]
  (<span style="color: #F0DFAF; font-weight: bold;">cond</span>
    (pos? shift) (<span style="color: #F0DFAF; font-weight: bold;">recur</span> (inc-first notes 12) (dec shift))
    (neg? shift) (<span style="color: #F0DFAF; font-weight: bold;">recur</span> (dec-last notes 12) (inc shift))
    (zero? shift) notes))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord</span>
  <span style="color: #9FC59F;">"Returns a set of notes for the specified chord. The root must be in</span>
<span style="color: #9FC59F;">  midi note format i.e. </span><span style="color: #BFEBBF;">:C4.</span>

<span style="color: #9FC59F;">  (chord </span><span style="color: #BFEBBF;">:c4</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:major</span><span style="color: #9FC59F;">)  ; c major           -&gt; #{60 64 67}</span>
<span style="color: #9FC59F;">  (chord </span><span style="color: #BFEBBF;">:a4</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:minor</span><span style="color: #9FC59F;">)  ; a minor           -&gt; #{57 60 64}</span>
<span style="color: #9FC59F;">  (chord </span><span style="color: #BFEBBF;">:Bb4</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:dim</span><span style="color: #9FC59F;">)   ; b flat diminished -&gt; #{70 73 76}</span>
<span style="color: #9FC59F;">  "</span>
  ([root chord-name]
   (chord root chord-name 0))
  ([root chord-name inversion]
     (<span style="color: #F0DFAF; font-weight: bold;">let</span> [root (note root)
           chord (resolve-chord chord-name)
           notes (map #(+ <span style="color: #DFAF8F;">%</span> root) chord)]
       (invert-chord notes inversion))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">rand-chord</span>
  <span style="color: #9FC59F;">"Generates a random list of MIDI notes with cardinality num-pitches</span>
<span style="color: #9FC59F;">  bound within the range of the specified root and pitch-range and</span>
<span style="color: #9FC59F;">  only containing pitches within the specified chord-name. Similar to</span>
<span style="color: #9FC59F;">  Impromptu's pc:make-chord"</span>
  [root chord-name num-pitches pitch-range]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [chord (chord root chord-name)
        root (note root)
        max-pitch (+ pitch-range root)
        roots (range 0 max-pitch 12)
        notes (flatten (map (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [root] (map #(+ root <span style="color: #DFAF8F;">%</span>) chord)) roots))
        notes (take-while #(&lt;= <span style="color: #DFAF8F;">%</span> max-pitch) notes)]
    (sort (choose-n num-pitches notes))))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">midicps</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">midi-&gt;hz</span>
  <span style="color: #9FC59F;">"Convert a midi note number to a frequency in hz."</span>
  [note]
  (* 440.0 (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>pow 2.0 (/ (- note 69.0) 12.0))))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">cpsmidi</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">hz-&gt;midi</span>
  <span style="color: #9FC59F;">"Convert from a frequency to the nearest midi note number."</span>
  [freq]
  (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>round (+ 69
                 (* 12
                    (/ (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>log (* freq 0.0022727272727))
                       (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>log 2))))))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">ampdb</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">amp-&gt;db</span>
  <span style="color: #9FC59F;">"Convert linear amplitude to decibels."</span>
  [amp]
  (* 20 (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>log10 amp)))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">dbamp</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">db-&gt;amp</span>
  <span style="color: #9FC59F;">"Convert decibels to linear amplitude."</span>
  [db]
  (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>exp (* (/ db 20) (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>log 10))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">nth-octave</span>
  <span style="color: #9FC59F;">"Returns the freq n octaves from the supplied reference freq</span>

<span style="color: #9FC59F;">   i.e. (nth-ocatve 440 1) will return 880 which is the freq of the</span>
<span style="color: #9FC59F;">   next octave from 440."</span>
  [freq n]
  (* freq (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>pow 2 n)))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">nth-equal-tempered-freq</span>
  <span style="color: #9FC59F;">"Returns the frequency of a given scale interval using an</span>
<span style="color: #9FC59F;">  equal-tempered tuning i.e. dividing all 12 semi-tones equally across</span>
<span style="color: #9FC59F;">  an octave. This is currently the standard tuning."</span>
  [base-freq interval]
  (* base-freq (<span style="color: #7CB8BB;">java.lang.Math</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>pow 2 (/ interval 12))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">interval-freq</span>
  <span style="color: #9FC59F;">"Returns the frequency of the given interval using the specified</span>
<span style="color: #9FC59F;">  mode and tuning (defaulting to ionian and equal-tempered</span>
<span style="color: #9FC59F;">  respectively)."</span>
  ([base-freq n] (interval-freq base-freq n <span style="color: #BFEBBF;">:ionian</span> <span style="color: #BFEBBF;">:equal-tempered</span>))
  ([base-freq n mode tuning]
     (<span style="color: #F0DFAF; font-weight: bold;">case</span> tuning
           <span style="color: #BFEBBF;">:equal-tempered</span> (nth-equal-tempered-freq base-freq (nth-interval n mode)))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">find-scale-name</span>
  <span style="color: #9FC59F;">"Return the name of the first matching scale found in SCALE</span>
<span style="color: #9FC59F;">  or nil if not found</span>

<span style="color: #9FC59F;">  ie: (find-scale-name [2 1 2 2 2 2 1]</span>
<span style="color: #9FC59F;">  </span><span style="color: #BFEBBF;">:melodic-minor-asc</span><span style="color: #9FC59F;">"</span>
  [scale]
  (reverse-get <span style="color: #BFEBBF;">SCALE</span> scale))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">find-pitch-class-name</span>
  <span style="color: #9FC59F;">"Given a midi number representing a note, returns the name of the note</span>
<span style="color: #9FC59F;">  independent of octave.</span>

<span style="color: #9FC59F;">  (find-pitch-class-name 62) ;=&gt; </span><span style="color: #BFEBBF;">:D</span>
<span style="color: #9FC59F;">  (find-pitch-class-name 74) ;=&gt; </span><span style="color: #BFEBBF;">:D</span>
<span style="color: #9FC59F;">  (find-pitch-class-name 75) ;=&gt; </span><span style="color: #BFEBBF;">:Eb</span><span style="color: #9FC59F;">"</span>
  [note]
  (REVERSE-NOTES (mod note 12)))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">find-note-name</span>
  [note]
  <span style="color: #CC9393;">"Given a midi number representing a note, returns a keyword</span>
<span style="color: #CC9393;">  representing the note including octave number. Reverse of the fn note.</span>

<span style="color: #CC9393;">  (find-note-name 45) ;=&gt; A2</span>
<span style="color: #CC9393;">  (find-note-name 57) ;=&gt; A3</span>
<span style="color: #CC9393;">  (find-note-name 58) ;=&gt; Bb3"</span>
  (<span style="color: #F0DFAF; font-weight: bold;">when</span> note (<span style="color: #F0DFAF; font-weight: bold;">let</span> [octave (dec (int (/ note 12)))]
               (keyword (str (name (find-pitch-class-name note)) octave)))))

(<span style="color: #F0DFAF; font-weight: bold;">defn-</span> <span style="color: #93E0E3;">fold-note</span>
  <span style="color: #9FC59F;">"Folds note intervals into a 2 octave range so that chords using</span>
<span style="color: #9FC59F;">  notes spread across multiple octaves can be correctly recognised."</span>
  [note]
  (<span style="color: #F0DFAF; font-weight: bold;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">or</span> (&lt; 21 note) (contains? #{20 19 16 12} note))
    (fold-note (- note 12))
     note ))

(<span style="color: #F0DFAF; font-weight: bold;">defn-</span> <span style="color: #93E0E3;">simplify-chord</span>
  <span style="color: #9FC59F;">"Expects notes to contain 0 (the root note) Reduces all notes into 2</span>
<span style="color: #9FC59F;">  octaves. This will allow identification of fancy jazz chords, but</span>
<span style="color: #9FC59F;">  will miss some simple chords if they are spread over more than 1</span>
<span style="color: #9FC59F;">  octave."</span>
  [notes]
  (set (map (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [x] (fold-note x)) notes)))

(<span style="color: #F0DFAF; font-weight: bold;">defn-</span> <span style="color: #93E0E3;">compress-chord</span>
  <span style="color: #9FC59F;">"Expects notes to contain 0 (the root note) Reduces all notes into 1</span>
<span style="color: #9FC59F;">  octave. This will lose all the fancy jazz chords but recognise</span>
<span style="color: #9FC59F;">  sparse multiple octave simple chords"</span>
  [notes]
  (set (map (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [x] (mod x 12)) notes)))

(<span style="color: #F0DFAF; font-weight: bold;">defn-</span> <span style="color: #93E0E3;">select-root</span>
  <span style="color: #9FC59F;">"Adds a new root note below the lowest note present in notes"</span>
  [notes root-index]
  (<span style="color: #F0DFAF; font-weight: bold;">if</span> (&lt; 0 root-index)
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [new-root (nth (seq (sort notes)) root-index)
         lowest-note (first (sort notes))
         octaves (+ 1 (quot (- new-root lowest-note) 12))]
      (set (cons (- new-root (* octaves 12)) notes)))
    notes))

(<span style="color: #F0DFAF; font-weight: bold;">defn-</span> <span style="color: #93E0E3;">find-chord-with-low-root</span>
  <span style="color: #9FC59F;">"Finds the chord represented by notes</span>
<span style="color: #9FC59F;">   Assumes the root note is the lowest note in notes</span>
<span style="color: #9FC59F;">   notes can be spread over multiple octaves"</span>
  [notes]
  (<span style="color: #F0DFAF; font-weight: bold;">if</span> (&lt; 0 (count notes))
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [root (first (sort notes))
          adjusted-notes (set (map (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [x] (- x root)) notes ))]
      (<span style="color: #F0DFAF; font-weight: bold;">or</span> (reverse-get <span style="color: #BFEBBF;">CHORD</span> (simplify-chord adjusted-notes))
          (reverse-get <span style="color: #BFEBBF;">CHORD</span> (compress-chord adjusted-notes))))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">find-chord</span>
  [notes]
  (<span style="color: #F0DFAF; font-weight: bold;">loop</span> [note 0]
    (<span style="color: #F0DFAF; font-weight: bold;">if</span> (&lt; note (count notes) )
      (<span style="color: #F0DFAF; font-weight: bold;">let</span> [mod-notes (select-root notes note)
            chord  (find-chord-with-low-root mod-notes)
            root (find-pitch-class-name (first (sort mod-notes)))]
       (<span style="color: #F0DFAF; font-weight: bold;">if</span> chord
         {<span style="color: #BFEBBF;">:root</span> root <span style="color: #BFEBBF;">:chord-type</span> chord}
         (<span style="color: #F0DFAF; font-weight: bold;">recur</span> (inc note))))
      <span style="color: #BFEBBF;">nil</span>)))


(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-degree</span>
  <span style="color: #9FC59F;">"Returns the notes constructed by picking thirds in a given scale</span>
<span style="color: #9FC59F;">  from in a given root. Useful if you want to try out playing standard</span>
<span style="color: #9FC59F;">  chord progressions. For example:</span>

<span style="color: #9FC59F;">  (chord-degree </span><span style="color: #BFEBBF;">:i</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:c4</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:ionian</span><span style="color: #9FC59F;">) ;=&gt; (60 64 67 71)</span>
<span style="color: #9FC59F;">  (chord-degree </span><span style="color: #BFEBBF;">:ii</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:c4</span><span style="color: #9FC59F;"> </span><span style="color: #BFEBBF;">:melodic-minor-asc</span><span style="color: #9FC59F;">) ;=&gt; (62 65 69 72)</span>
<span style="color: #9FC59F;">  "</span>
  ([degree root mode]
    (chord-degree degree root mode 4))
  ([degree root mode num-notes]
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [d-int (degree-&gt;int degree)
          num-degrees (- (+ d-int (* num-notes 2)) 1)]
          (take-nth 2 (drop (degree-&gt;int degree) (scale root mode (range num-degrees)))))))

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">* shufflers (randomize a sequence, or notes within a scale, etc.)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">*</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">* Sequence generators</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">- probabilistic arpeggiator</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">- take a rhythym seq, note seq, and groove seq</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">- latin sounds</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">- house sounds</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">- minimal techno sounds</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">- drum and bass sounds</span>
<span style="color: #5F7F5F;">;;</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">* create a library of sequence modifiers and harmonizers</span>

<span style="color: #5F7F5F;">;;; </span><span style="color: #7F9F7F;">ideas:</span>

<span style="color: #5F7F5F;">;;; </span><span style="color: #7F9F7F;">represent all notes with midi numbers</span>
<span style="color: #5F7F5F;">;;; </span><span style="color: #7F9F7F;">represent sequences of notes (i.e. scales) with vectors/lists</span>
<span style="color: #5F7F5F;">;;; </span><span style="color: #7F9F7F;">represent sequences of durations with vectors/lists</span>
<span style="color: #5F7F5F;">;;; </span><span style="color: #7F9F7F;">[1 3 5 7]</span>
<span style="color: #5F7F5F;">;;; </span><span style="color: #7F9F7F;">represent chords with sets</span>
<span style="color: #5F7F5F;">;;; </span><span style="color: #7F9F7F;">#{1 3 5}</span>
<span style="color: #5F7F5F;">;;</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">[1 3 5 #{1 4 5} 7]</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">[1 1 2     6    3]</span>


<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">chromatic notes -&gt; 0-11</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">degrees -&gt; i -&gt; vii</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">chord - concrete: (60 64 67)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">chord - concrete - chromatic notes: (4 7 12)</span>


<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">chord - abstract - chromatic notes: (0 4 7)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">chord - abstract - chromatic notes: (0 4 7)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">chord - abstract - degrees: (i iii v)</span>
</pre>
</div>
</div></li></ol>
</div>
</div>
