src/post_tonal_overtone/org_files/build-voice-leading-engine.org
** remember meaningful phenomena
While randomly generating material can be great fun, sometimes you
strike on something you really like, or you desire to start building
up something more permament and substantial. 
*** write 6 note voicing to disk
Let's use another version of the block from the last section. In this
case, however, we have added a function that will write out data to a
file on disk.

#+BEGIN_SRC clojure :session vle :results output
;; Note, we use the mod12 function defined in the last block

(let [midis (rand-chord :A2 :7+5-9 6 48)]
  (play-piano-chord midis)
  (do (println (map find-note-name midis))
      (println midis)
      (println (map mod12 midis))
      (spit "src/post_tonal_overtone/data/saved-voicings.clj"
            (pr-str midis) :append true)
  ))
#+END_SRC

#+RESULTS:
: (:Bb3 :C#4 :A4 :F5 :G5 :A5)
: (58 61 69 77 79 81)
: (10 1 9 5 7 9)

Reading and writing to disk gets rather quickly into some deep and
critical stuff about using programming languages to accomplish things
that will persist. We can think a little about this now, but will
largely skirt the issue until later.

*** stateful versions (?)
So the reasons for keeping track of what you have done should be
clear. For example, you might think "This generated chord was
particularly attractive. Wouldn't it be nice to keep track of such
things? And to revist and try out sequences of these things? And then
be able to vary their order? And articulate them differently? Or
subsume them within some larger structure that begins to emerge after
using a bunch of them?"

(Or at least, that's what I think!)

By capturing our work in emacs and org-mode, we can get a limited sort
of persistence, but presents some problems when we think about
convenience, usability and maintainability.

For example, how do you cycle between these two things?


#+BEGIN_SRC clojure
(play-piano-chord '(57 58 65 67 79 85))
;; (play-piano-chord '(53 57 58 65 79 81))
#+END_SRC

#+RESULTS:
: nil

Well, we will need to take advantage of some of Clojure's capabilities
for doing "stateful" things, which may require some kind of swap-ping
or dereferencing of a stateful thing. Huh?

*** using an atom and swap to derefence and set a new value
An atom is one of Clojure's techniques for managing "stateful things,"
that is, named "objects" that store or refer to some kind of value.
This can all be rather abstract. Let's look at an example

#+BEGIN_SRC clojure
;; [[__ 57 58 65 67 79 __ 85]
;;  [53 57 58 65 __ 79 81]]
(def a (atom (vec (take 100 (cycle [[57 58 65 67 79 85]
                                    [53 57 58 65 79 81]])))))
#+END_SRC

#+RESULTS:
: #'user/a

#+BEGIN_SRC clojure
(first (swap! a rest))
#+END_SRC

#+RESULTS:
| 57 | 58 | 65 | 67 | 79 | 85 |

#+BEGIN_SRC clojure
(play-piano-chord (first (swap! a rest)))
#+END_SRC  

#+RESULTS:
: nil

Most interstingly, let's re-use a bit of that function from above that
prints out some details about our notes.

#+BEGIN_SRC clojure :results output
(let [midis (first (swap! a rest))]
(do (println (map find-note-name midis))
    (println midis)
    (println (map mod12 midis))
    (println (count @a))
    (play-piano-chord midis)
  ))
#+END_SRC

#+RESULTS:
: (:A3 :Bb3 :F4 :G4 :G5 :C#6)
: [57 58 65 67 79 85]
: (9 10 5 7 7 1)
: 90

*** let's make a cycle with a few more things
If we can alternate between two things in this fashion, if might be
fun to proceed through between a longer sequence of such things

#+BEGIN_SRC clojure
(def b (atom (vec (take 100 (cycle '((53 55 58 61 77 85)(57 58 65 67 79 85)(45 55 61 65 67 70)(45 61 65 67 70 77)))))))
#+END_SRC

#+RESULTS:
: #'user/b

Now we work through a series of 4 different voicings of this
interesting chord>

#+BEGIN_SRC clojure :results output
(let [midis (first (swap! b rest))]
(do (println (map find-note-name midis))
    (println midis)
    (println (map mod12 midis))
    (println (count @b))
    (play-piano-chord midis)
  ))
#+END_SRC

#+RESULTS:
: (:A2 :G3 :C#4 :F4 :G4 :Bb4)
: (45 55 61 65 67 70)
: (9 7 1 5 7 10)
: 94

#+BEGIN_SRC clojure :session getting-started :tangle yes 
(definst saw1 [freq 330 attack 0.3 sustain 0.15 release 0.25 vol 0.2 length 5]
  (* (env-gen (lin attack sustain release) 1 1 0 length FREE)
     (saw freq)
     vol))

(saw1)
#+END_SRC

#+RESULTS:
: #<instrument: saw1>#<synth-node[loading]: user/saw1 152>

#+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn play-chord-saw1 [a-chord]
  (doseq [note a-chord] (saw1 (midi->hz note))))
#+END_SRC

#+RESULTS:
: #'user/play-chord-saw1

And now let's read it from another source
#+BEGIN_SRC clojure :results output
(let [midis (first (swap! b rest))]
(do (println (map find-note-name midis))
    (println midis)
    (println (map mod12 midis))
    (println (count @b))
    (play-chord-saw1 midis)
  ))
#+END_SRC

#+RESULTS:
: (:A2 :C#4 :F4 :G4 :Bb4 :F5)
: (45 61 65 67 70 77)
: (9 1 5 7 10 5)
: 89

*** working with stateful objects without atom management
You CAN do this, but whether you should is another matter. Or rather
an exact understanding of why you should or shouldn't and how to do it
if you do is what ultimately is most important (and involves ~atoms~,
as above).

For now, however, let's see how this works, in contrast to using
~atoms~.

#+BEGIN_SRC clojure :session vle :results output
(def stateful-chord (rand-chord :A2 :7+5-9 6 48))

(let [midis stateful-chord]
  (play-piano-chord midis)
  (do (println (map find-note-name midis))
  (println midis)
  (println (map mod12 midis)
    )))
#+END_SRC

#+RESULTS:
: (:F3 :G3 :A3 :F5 :G5 :A5)
: (53 55 57 77 79 81)
: (5 7 9 5 7 9)

See it here again:

#+BEGIN_SRC clojure
(let [midis stateful-chord]
  (play-piano-chord midis))

stateful-chord
#+END_SRC

#+RESULTS:
: nil(53 55 57 77 79 81)

#+BEGIN_SRC clojure
stateful-chord
#+END_SRC

#+RESULTS:
| 53 | 55 | 57 | 77 | 79 | 81 |

What's the harm in constantly generating new values for this
"stateful-chord" thing? Perhaps the simplest thing to say is that it
prevents us from learning how to work through Clojure's existing
mechanisms that have been finely-wrought for navigating the complexity
that is potentially involved.

