src/post_tonal_overtone/org_files/html-versions/build-voice-leading-engine.html

<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">4.2</span> remember meaningful phenomena</h3>
<div class="outline-text-3" id="text-4-2">
<p>
While randomly generating material can be great fun, sometimes you
strike on something you really like, or you desire to start building
up something more permament and substantial. 
</p>
</div>
<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">4.2.1</span> write 6 note voicing to disk</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Let's use another version of the block from the last section. In this
case, however, we have added a function that will write out data to a
file on disk.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Note, we use the mod12 function defined in the last block</span>

(<span style="color: #F0DFAF; font-weight: bold;">let</span> [midis (rand-chord <span style="color: #BFEBBF;">:A2</span> <span style="color: #BFEBBF;">:7+5-9</span> 6 48)]
  (play-piano-chord midis)
  (<span style="color: #F0DFAF; font-weight: bold;">do</span> (println (map find-note-name midis))
      (println midis)
      (println (map mod12 midis))
      (spit <span style="color: #CC9393;">"src/post_tonal_overtone/data/saved-voicings.clj"</span>
            (pr-str midis) <span style="color: #BFEBBF;">:append</span> <span style="color: #BFEBBF;">true</span>)
  ))
</pre>
</div>

<p>
Reading and writing to disk gets rather quickly into some deep and
critical stuff about using programming languages to accomplish things
that will persist. We can think a little about this now, but will
largely skirt the issue until later.
</p>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">4.2.2</span> stateful versions (?)</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
So the reasons for keeping track of what you have done should be
clear. For example, you might think "This generated chord was
particularly attractive. Wouldn't it be nice to keep track of such
things? And to revist and try out sequences of these things? And then
be able to vary their order? And articulate them differently? Or
subsume them within some larger structure that begins to emerge after
using a bunch of them?"
</p>

<p>
(Or at least, that's what I think!)
</p>

<p>
By capturing our work in emacs and org-mode, we can get a limited sort
of persistence, but presents some problems when we think about
convenience, usability and maintainability.
</p>

<p>
For example, how do you cycle between these two things?
</p>


<div class="org-src-container">

<pre class="src src-clojure">(play-piano-chord '(57 58 65 67 79 85))
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(play-piano-chord '(53 57 58 65 79 81))</span>
</pre>
</div>

<p>
Well, we will need to take advantage of some of Clojure's capabilities
for doing "stateful" things, which may require some kind of swap-ping
or dereferencing of a stateful thing. Huh?
</p>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">4.2.3</span> using an atom and swap to derefence and set a new value</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
An atom is one of Clojure's techniques for managing "stateful things,"
that is, named "objects" that store or refer to some kind of value.
This can all be rather abstract. Let's look at an example
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">[[__ 57 58 65 67 79 __ 85]</span>
<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">[53 57 58 65 __ 79 81]]</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">a</span> (atom (vec (take 100 (cycle [[57 58 65 67 79 85]
                                    [53 57 58 65 79 81]])))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(first (swap! a rest))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(play-piano-chord (first (swap! a rest)))
</pre>
</div>

<p>
Most interstingly, let's re-use a bit of that function from above that
prints out some details about our notes.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">let</span> [midis (first (swap! a rest))]
(<span style="color: #F0DFAF; font-weight: bold;">do</span> (println (map find-note-name midis))
    (println midis)
    (println (map mod12 midis))
    (println (count @a))
    (play-piano-chord midis)
  ))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">4.2.4</span> let's make a cycle with a few more things</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
If we can alternate between two things in this fashion, if might be
fun to proceed through between a longer sequence of such things
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">b</span> (atom (vec (take 100 (cycle '((53 55 58 61 77 85)(57 58 65 67 79 85)(45 55 61 65 67 70)(45 61 65 67 70 77)))))))
</pre>
</div>

<p>
Now we work through a series of 4 different voicings of this
interesting chord&gt;
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">let</span> [midis (first (swap! b rest))]
(<span style="color: #F0DFAF; font-weight: bold;">do</span> (println (map find-note-name midis))
    (println midis)
    (println (map mod12 midis))
    (println (count @b))
    (play-piano-chord midis)
  ))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">saw1</span> [freq 330 attack 0.3 sustain 0.15 release 0.25 vol 0.2 length 5]
  (* (env-gen (lin attack sustain release) 1 1 0 length <span style="color: #BFEBBF;">FREE</span>)
     (saw freq)
     vol))

(saw1)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">play-chord-saw1</span> [a-chord]
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note a-chord] (saw1 (midi-&gt;hz note))))
</pre>
</div>

<p>
And now let's read it from another source
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">let</span> [midis (first (swap! b rest))]
(<span style="color: #F0DFAF; font-weight: bold;">do</span> (println (map find-note-name midis))
    (println midis)
    (println (map mod12 midis))
    (println (count @b))
    (play-chord-saw1 midis)
  ))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">4.2.5</span> working with stateful objects without atom management</h4>
<div class="outline-text-4" id="text-4-2-5">
<p>
You CAN do this, but whether you should is another matter. Or rather
an exact understanding of why you should or shouldn't and how to do it
if you do is what ultimately is most important (and involves <code>atoms</code>,
as above).
</p>

<p>
For now, however, let's see how this works, in contrast to using
<code>atoms</code>.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">stateful-chord</span> (rand-chord <span style="color: #BFEBBF;">:A2</span> <span style="color: #BFEBBF;">:7+5-9</span> 6 48))

(<span style="color: #F0DFAF; font-weight: bold;">let</span> [midis stateful-chord]
  (play-piano-chord midis)
  (<span style="color: #F0DFAF; font-weight: bold;">do</span> (println (map find-note-name midis))
  (println midis)
  (println (map mod12 midis)
    )))
</pre>
</div>

<p>
See it here again:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">let</span> [midis stateful-chord]
  (play-piano-chord midis))

stateful-chord
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">stateful-chord
</pre>
</div>

<p>
What's the harm in constantly generating new values for this
"stateful-chord" thing? Perhaps the simplest thing to say is that it
prevents us from learning how to work through Clojure's existing
mechanisms that have been finely-wrought for navigating the complexity
that is potentially involved.
</p>
</div>
</div>
