src/post_tonal_overtone/org_files/build-voice-leading-engine.org
*** reading from and writing to disk
Now, as above, we might be interested enough in what we have generated
to save it to disk.

#+BEGIN_SRC clojure
(spit "src/post_tonal_overtone/data/fave-voicings.clj"
      (pr-str stateful-chord) :append true)
#+END_SRC

#+RESULTS:
: nil

Which is great, but how do we most conveniently get it back? Reading
it from disk in the following manner doesn't quite work the way you
would want.

#+BEGIN_SRC clojure
(read-string (slurp "src/post_tonal_overtone/data/fave-voicings.clj"))
#+END_SRC

#+RESULTS:
| 53 | 55 | 58 | 61 | 77 | 85 |

It's great that we getting the first thing we saved to that file, but
there's more there!

(In emacs, on my local system, I can confirm this by visiting the following:

And C-c C-o to see that the file contains the last "stateful chord"
[[file:~/git-projects/post_tonal_overtone/src/post_tonal_overtone/data/fave-voicings.clj]]
*** we want to read-write with streams instead
To start getting into more sophisticated ways of persisting data, we
may need to delve into one of the things that makes Clojure unique:
it's ability to use the underlying mechanisms of the JVM to work with
the local system.

(note some of this is derived from section [[file:~/git/org/clojure-books.org::*4.9.%20Reading%20and%20Writing%20Text%20Files][4.9. Reading and Writing
Text Files]] in the Clojure Cookbook)

 #+BEGIN_SRC clojure
(with-open [w (clojure.java.io/writer "stuff.txt")]
  (doseq [line some-large-seq-of-strings]
    (.write w line)
    (.newLine w)))
 #+END_SRC



*** with-open and java file writing interop
In order to delve deeply, we need to understand how to build up a
little larger piece of java interop
 #+BEGIN_SRC clojure
;; "src/post_tonal_overtone/transposed-data.clj"

;;  /Users/a/git-projects/post_tonal_overtone/src/post_tonal_overtone/data:

 (require '[clojure.java.io :as io])

(defn append-to [f text]
  (with-open [w (io/writer f :append true)]
    (doto w (.write text) .flush)))


 #+END_SRC

 #+RESULTS:
 : nil#'post_tonal_overtone.core/append-to

=Append-to= is our little wrapper around writing some kind of text to a file that
we pass in as an argument. 
 #+BEGIN_SRC clojure
(append-to "src/post_tonal_overtone/data/short-test.clj" " still more text with spaces ")
 #+END_SRC

 #+RESULTS:
 : #<BufferedWriter java.io.BufferedWriter@1f28c0ea>


 #+BEGIN_SRC clojure
(slurp "src/post_tonal_overtone/data/short-test.clj")
 #+END_SRC

 #+RESULTS:
 : [:a :b :c]this is textthis is more text still more text with spaces 

While this is nice for proving that we can take arbitrary output from
our programs and store them in a file, we still have to deal with easy
ways of accessing that stuff.

For example, using read-string on the =slurp=-ing that we just did
still leaves the same problem of getting back more than the first
thing.
 #+BEGIN_SRC clojure
(read-string (slurp "src/post_tonal_overtone/data/short-test.clj"))

 #+END_SRC

 #+RESULTS:
 | :a | :b | :c |

What would be nice would be to cycle through the contents of some file
in a piecemeal fashion. What we are bumping into here is a
 /sine qua non/ of programming, which is getting information from a
database.

We'll think more deeply about this soon enough.

*** developing an understanding of state
One of the main issues in all the above is when there are other
"clients" interacting with the data we have stored to some "object" or
"location." Or what about if you wanted to keep that object available
in clojure and not just on disk somehow, i.e. how should it persist?

And what if you wanted to keep that thing around when using clojure
and wanted it to contain an ever expanding list of your favorite
chords?

Why, then you would be interested in an honest-to-goodness database!

This whole other can of worms is described in an in-progress tutorial
on using Clojure to store info using SQL.

** playing a melody involves time idioms
We've seen a little before about how to get sound to happen with
overtone at a particular time.
*** start simply with 'this' moment
#+BEGIN_SRC clojure :session vle
(at (now) (play-piano-chord (chord :C4 :major)))
#+END_SRC

#+RESULTS:
: nil


Or now, set-off by 1000 milliseconds.

#+BEGIN_SRC clojure :session vle
(at (+ 1000 (now)) (play-piano-chord (chord :C4 :major)))
#+END_SRC

#+RESULTS:
: nil

*** using a metronome as timer for more sequenced items
However, we rarely want to schedule just a single event.
**** copied standard example
Here's a version of a common example to demonstrate scheduling several
events.

  #+BEGIN_SRC clojure
;; We can play a chord progression on the synth
;; using times:
(defn chord-progression-time []
  (let [time (now)]
    (at time (play-piano-chord (chord :C4 :major)))
    (at (+ 2000 time) (play-piano-chord (chord :G3 :major)))
    (at (+ 3000 time) (play-piano-chord (chord :F3 :sus4)))
    (at (+ 4300 time) (play-piano-chord (chord :F3 :major)))
    (at (+ 5000 time) (play-piano-chord (chord :G3 :major)))))

(chord-progression-time)

  #+END_SRC

  #+RESULTS:
  : #'user/chord-progression-timenil
