src/post_tonal_overtone/org_files/html-versions/build-voice-leading-engine.html

<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">4.2.6</span> reading from and writing to disk</h4>
<div class="outline-text-4" id="text-4-2-6">
<p>
Now, as above, we might be interested enough in what we have generated
to save it to disk.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(spit <span style="color: #CC9393;">"src/post_tonal_overtone/data/fave-voicings.clj"</span>
      (pr-str stateful-chord) <span style="color: #BFEBBF;">:append</span> <span style="color: #BFEBBF;">true</span>)
</pre>
</div>

<p>
Which is great, but how do we most conveniently get it back? Reading
it from disk in the following manner doesn't quite work the way you
would want.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(read-string (slurp <span style="color: #CC9393;">"src/post_tonal_overtone/data/fave-voicings.clj"</span>))
</pre>
</div>

<p>
It's great that we getting the first thing we saved to that file, but
there's more there!
</p>

<p>
(In emacs, on my local system, I can confirm this by visiting the following:
</p>

<p>
And C-c C-o to see that the file contains the last "stateful chord"
<a href="file:///Users/b/git-projects/post_tonal_overtone/src/post_tonal_overtone/data/fave-voicings.clj">file:///Users/b/git-projects/post_tonal_overtone/src/post_tonal_overtone/data/fave-voicings.clj</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">4.2.7</span> we want to read-write with streams instead</h4>
<div class="outline-text-4" id="text-4-2-7">
<p>
To start getting into more sophisticated ways of persisting data, we
may need to delve into one of the things that makes Clojure unique:
it's ability to use the underlying mechanisms of the JVM to work with
the local system.
</p>

<p>
(note some of this is derived from section <a href="file:///Users/b/git/org/clojure-books.html#MissingReference">4.9. Reading and Writing
Text Files</a> in the Clojure Cookbook)
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">with-open</span> [w (<span style="color: #7CB8BB;">clojure.java.io</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>writer <span style="color: #CC9393;">"stuff.txt"</span>)]
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [line some-large-seq-of-strings]
    (<span style="color: #94BFF3;">.write</span> w line)
    (<span style="color: #94BFF3;">.newLine</span> w)))
</pre>
</div>
</div>
</div>



<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">4.2.8</span> with-open and java file writing interop</h4>
<div class="outline-text-4" id="text-4-2-8">
<p>
In order to delve deeply, we need to understand how to build up a
little larger piece of java interop
</p>
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">"src/post_tonal_overtone/transposed-data.clj"</span>

<span style="color: #5F7F5F;">;;  </span><span style="color: #7F9F7F;">/Users/a/git-projects/post_tonal_overtone/src/post_tonal_overtone/data:</span>

 (require '[<span style="color: #7CB8BB;">clojure.java.io</span> <span style="color: #BFEBBF;">:as</span> io])

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">append-to</span> [f text]
  (<span style="color: #F0DFAF; font-weight: bold;">with-open</span> [w (<span style="color: #7CB8BB;">io</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>writer f <span style="color: #BFEBBF;">:append</span> <span style="color: #BFEBBF;">true</span>)]
    (<span style="color: #F0DFAF; font-weight: bold;">doto</span> w (<span style="color: #94BFF3;">.write</span> text) <span style="color: #94BFF3;">.flush</span>)))
</pre>
</div>

<p>
<code>Append-to</code> is our little wrapper around writing some kind of text to a file that
we pass in as an argument. 
</p>
<div class="org-src-container">

<pre class="src src-clojure">(append-to <span style="color: #CC9393;">"src/post_tonal_overtone/data/short-test.clj"</span> <span style="color: #CC9393;">" still more text with spaces "</span>)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(slurp <span style="color: #CC9393;">"src/post_tonal_overtone/data/short-test.clj"</span>)
</pre>
</div>

<p>
While this is nice for proving that we can take arbitrary output from
our programs and store them in a file, we still have to deal with easy
ways of accessing that stuff.
</p>

<p>
For example, using read-string on the <code>slurp</code>-ing that we just did
still leaves the same problem of getting back more than the first
thing.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(read-string (slurp <span style="color: #CC9393;">"src/post_tonal_overtone/data/short-test.clj"</span>))
</pre>
</div>

<p>
What would be nice would be to cycle through the contents of some file
in a piecemeal fashion. What we are bumping into here is a
 <i>sine qua non</i> of programming, which is getting information from a
database.
</p>

<p>
We'll think more deeply about this soon enough.
</p>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">4.2.9</span> developing an understanding of state</h4>
<div class="outline-text-4" id="text-4-2-9">
<p>
One of the main issues in all the above is when there are other
"clients" interacting with the data we have stored to some "object" or
"location." Or what about if you wanted to keep that object available
in clojure and not just on disk somehow, i.e. how should it persist?
</p>

<p>
And what if you wanted to keep that thing around when using clojure
and wanted it to contain an ever expanding list of your favorite
chords?
</p>

<p>
Why, then you would be interested in an honest-to-goodness database!
</p>

<p>
This whole other can of worms is described in an in-progress tutorial
on using Clojure to store info using SQL.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline42" class="outline-3">
<h3 id="orgheadline42"><span class="section-number-3">4.3</span> playing a melody involves time idioms</h3>
<div class="outline-text-3" id="text-4-3">
<p>
We've seen a little before about how to get sound to happen with
overtone at a particular time.
</p>
</div>
<div id="outline-container-orgheadline33" class="outline-4">
<h4 id="orgheadline33"><span class="section-number-4">4.3.1</span> start simply with 'this' moment</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">

<pre class="src src-clojure">(at (now) (play-piano-chord (chord <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:major</span>)))
</pre>
</div>


<p>
Or now, set-off by 1000 milliseconds.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(at (+ 1000 (now)) (play-piano-chord (chord <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:major</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">4.3.2</span> using a metronome as timer for more sequenced items</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
However, we rarely want to schedule just a single event.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline34"></a>copied standard example<br  /><div class="outline-text-5" id="text-4-3-2-1">
<p>
Here's a version of a common example to demonstrate scheduling several
events.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">We can play a chord progression on the synth</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">using times:</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time</span> []
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [time (now)]
    (at time (play-piano-chord (chord <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:major</span>)))
    (at (+ 2000 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:major</span>)))
    (at (+ 3000 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:sus4</span>)))
    (at (+ 4300 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:major</span>)))
    (at (+ 5000 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:major</span>)))))

(chord-progression-time)
</pre>
</div>
</div></li>
