src/post_tonal_overtone/org_files/build-voice-leading-engine.org
**** cleaned up standard modified with other chord qualities
But once we get how this works, we can recognize that it is rather
brittle (not to mention that the chord progression does not especially
reflect the impetus behind this tutorial, which is to think about how
to make music in a post-tonal style. 

Let's try out some of the other common chord types overtone makes
available. Additionally we'll take the wise step of removing the
hard-coded times at which the events should start.

  #+BEGIN_SRC clojure
;; you will now be able to assign play-times relative to the start
;; time, by passing in a list of "on-times" in milliseconds
(defn my-chord-progression-time [times]
  (let [time (now)
        [time1 time2 time3 time4 time5] times]
    (at time (play-piano-chord (chord :C4 :dom7)))
    (at (+ time1 time) (play-piano-chord (chord :G3 :major7)))
    (at (+ time2 time) (play-piano-chord (chord :F3 :sus4)))
    (at (+ time3 time) (play-piano-chord (chord :F3 :sus2)))
    (at (+ time4 time) (play-piano-chord (chord :G3 :minor7)))
    (at (+ time5 time) (play-piano-chord (chord :C3 :dim)))))



  #+END_SRC

  #+RESULTS:
  : #'user/my-chord-progression-time

#+BEGIN_SRC clojure
(my-chord-progression-time '(2000 4000 6000 9000 13000 15000))
#+END_SRC

#+RESULTS:
: nil

*** defined ~play~ doesn't have an example in the documentation
Let's look at another example of making a function that will play
things for us in time.

**** as defined, will play a sequence separated by a specified millisecond amount
This version has been slightly modified to use the sampled-piano instrument

Whereas other timing functions we have used were motivated by the
desire to play chords, here we can demonstrate another kind of common
musical phenomenon: the arpeggio, which is basically just a chord
played spread out over the course of brief span of time.

#+BEGIN_SRC clojure :session vle
(defn play [time notes sep]
  (let [note (first notes)]
    (when note
      (at time (sampled-piano note)))
    (let [next-time (+ time sep)]
      (apply-at next-time play [next-time (rest notes) sep]))))
#+END_SRC

#+RESULTS:
: #'user/play

#+BEGIN_SRC clojure :session vle
(play (now) [60 64 71] 200)
#+END_SRC

#+RESULTS:
: #<ScheduledJob id: 1, created-at: Thu 07:07:50s, initial-delay: 199, desc: "Overtone delayed fn", scheduled? true>

: #<ScheduledJob id: 1, created-at: Thu 06:28:00s, initial-delay: 198, desc: "Overtone delayed fn", scheduled? true>

**** nice: provide a large list as an argument and get out a long sequence of notes
#+BEGIN_SRC clojure
(recording-start "/Users/a/Google Drive/wav-file-uploads/arps1.wav")
#+END_SRC

#+RESULTS:
: :recording-started

#+BEGIN_SRC clojure :session vle
(play (now) (flatten cmajtriads) 100)
#+END_SRC

#+RESULTS:
: #<ScheduledJob id: 331450, created-at: Thu 10:45:18s, initial-delay: 99, desc: "Overtone delayed fn", scheduled? true>



#+RESULTS:
: :recording-started

#+BEGIN_SRC clojure
(recording-stop)
#+END_SRC

#+RESULTS:
: /Users/a/Google Drive/wav-file-uploads/arps1.wav

#+BEGIN_SRC clojure :session vle
(play (now) (flatten set-class/cmajtriads) 100)
#+END_SRC

#+RESULTS:


#+RESULTS:
: /Users/a/Google Drive/wav-file-uploads/arps1.wav



: #<ScheduledJob id: 45, created-at: Sat 01:46:34s, initial-delay: 99, desc: "Overtone delayed fn", scheduled? true>


: #<ScheduledJob id: 4401268, created-at: Wed 04:48:49s, initial-delay: 200, desc: "Overtone delayed fn", scheduled? true>

**** modified (fails?)
Why do you need to pass in the time it starts? Any reason that
shouldn't be now? Wouldn't be more useful to be able to vary what
instrument you want to be playing? Here's a version that add an
instrument function.

#+BEGIN_SRC clojure :session vle
(defn my-play [inst notes sep]
  (let [note (first notes)
        time (now)]
    (when note
      (at time (inst note)))
    (let [next-time (+ time sep)]
      (apply-at next-time my-play [inst (rest notes) sep]))))
#+END_SRC

#+RESULTS:
: #'user/my-play

#+BEGIN_SRC clojure :session vle
(my-play sampled-piano [60 64 67] 2000)
#+END_SRC

#+RESULTS:
: #<ScheduledJob id: 1440, created-at: Thu 07:09:30s, initial-delay: 1998, desc: "Overtone delayed fn", scheduled? true>

**** modify to play with random intervals between notes (fails to reapply)
This naive attempt to get different rhythms reveals that there is some
misconception in how =apply-at= works. We'll have to deal with this
question of different rhythms in the next major section.

#+BEGIN_SRC clojure :session vle
(defn new-play [time notes seps]
  (let [note (first notes)
        sep (rand-nth seps)]
    (when note
      (at time (sampled-piano note))
      (println sep))
    (let [next-time (+ time (rand-nth seps))]
      (apply-at next-time play [next-time (rest notes) (rand-nth seps)]))))
#+END_SRC

#+RESULTS:
: #'user/new-play

#+BEGIN_SRC clojure
(new-play (now) (flatten cmajtriads) [100 1000])
#+END_SRC

#+RESULTS:
: #<ScheduledJob id: 1695, created-at: Thu 07:09:46s, initial-delay: 98, desc: "Overtone delayed fn", scheduled? true>

#+BEGIN_SRC clojure :session vle
(new-play (now) (flatten set-class/cmajtriads) [100 1000])
#+END_SRC

#+RESULTS:
: #<ScheduledJob id: 4637, created-at: Sat 01:51:36s, initial-delay: 998, desc: "Overtone delayed fn", scheduled? true>

* generate large databases of musical events
Once we start playing these long sequences of some related chords, it
becomes apparent that there are some obvious ways that extend this and
make it more musically interesting.
