src/post_tonal_overtone/org_files/html-versions/build-voice-leading-engine.html
<li><a id="orgheadline35"></a>cleaned up standard modified with other chord qualities<br  /><div class="outline-text-5" id="text-4-3-2-2">
<p>
But once we get how this works, we can recognize that it is rather
brittle (not to mention that the chord progression does not especially
reflect the impetus behind this tutorial, which is to think about how
to make music in a post-tonal style. 
</p>

<p>
Let's try out some of the other common chord types overtone makes
available. Additionally we'll take the wise step of removing the
hard-coded times at which the events should start.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">you will now be able to assign play-times relative to the start</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">time, by passing in a list of "on-times" in milliseconds</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">my-chord-progression-time</span> [times]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [time (now)
        [time1 time2 time3 time4 time5] times]
    (at time (play-piano-chord (chord <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:dom7</span>)))
    (at (+ time1 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:major7</span>)))
    (at (+ time2 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:sus4</span>)))
    (at (+ time3 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:sus2</span>)))
    (at (+ time4 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:minor7</span>)))
    (at (+ time5 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:C3</span> <span style="color: #BFEBBF;">:dim</span>)))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(my-chord-progression-time '(2000 4000 6000 9000 13000 15000))
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">4.3.3</span> defined <code>play</code> doesn't have an example in the documentation</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
Let's look at another example of making a function that will play
things for us in time.
</p>
</div>

<ol class="org-ol"><li><a id="orgheadline37"></a>as defined, will play a sequence separated by a specified millisecond amount<br  /><div class="outline-text-5" id="text-4-3-3-1">
<p>
This version has been slightly modified to use the sampled-piano instrument
</p>

<p>
Whereas other timing functions we have used were motivated by the
desire to play chords, here we can demonstrate another kind of common
musical phenomenon: the arpeggio, which is basically just a chord
played spread out over the course of brief span of time.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">play</span> [time notes sep]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (first notes)]
    (<span style="color: #F0DFAF; font-weight: bold;">when</span> note
      (at time (sampled-piano note)))
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [next-time (+ time sep)]
      (apply-at next-time play [next-time (rest notes) sep]))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(play (now) [60 64 71] 200)
</pre>
</div>

<pre class="example">
#&lt;ScheduledJob id: 1, created-at: Thu 06:28:00s, initial-delay: 198, desc: "Overtone delayed fn", scheduled? true&gt;
</pre>
</div></li>

<li><a id="orgheadline38"></a>nice: provide a large list as an argument and get out a long sequence of notes<br  /><div class="outline-text-5" id="text-4-3-3-2">
<div class="org-src-container">

<pre class="src src-clojure">(recording-start <span style="color: #CC9393;">"/Users/a/Google Drive/wav-file-uploads/arps1.wav"</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(play (now) (flatten cmajtriads) 100)
</pre>
</div>



<pre class="example">
:recording-started
</pre>

<div class="org-src-container">

<pre class="src src-clojure">(recording-stop)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(play (now) (flatten <span style="color: #7CB8BB;">set-class</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>cmajtriads) 100)
</pre>
</div>


<pre class="example">
/Users/a/Google Drive/wav-file-uploads/arps1.wav
</pre>



<pre class="example">
#&lt;ScheduledJob id: 45, created-at: Sat 01:46:34s, initial-delay: 99, desc: "Overtone delayed fn", scheduled? true&gt;
</pre>


<pre class="example">
#&lt;ScheduledJob id: 4401268, created-at: Wed 04:48:49s, initial-delay: 200, desc: "Overtone delayed fn", scheduled? true&gt;
</pre>
</div></li>

<li><a id="orgheadline39"></a>modified (fails?)<br  /><div class="outline-text-5" id="text-4-3-3-3">
<p>
Why do you need to pass in the time it starts? Any reason that
shouldn't be now? Wouldn't be more useful to be able to vary what
instrument you want to be playing? Here's a version that add an
instrument function.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">my-play</span> [inst notes sep]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (first notes)
        time (now)]
    (<span style="color: #F0DFAF; font-weight: bold;">when</span> note
      (at time (inst note)))
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [next-time (+ time sep)]
      (apply-at next-time my-play [inst (rest notes) sep]))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(my-play sampled-piano [60 64 67] 2000)
</pre>
</div>
</div></li>

<li><a id="orgheadline40"></a>modify to play with random intervals between notes (fails to reapply)<br  /><div class="outline-text-5" id="text-4-3-3-4">
<p>
This naive attempt to get different rhythms reveals that there is some
misconception in how <code>apply-at</code> works. We'll have to deal with this
question of different rhythms in the next major section.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">new-play</span> [time notes seps]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (first notes)
        sep (rand-nth seps)]
    (<span style="color: #F0DFAF; font-weight: bold;">when</span> note
      (at time (sampled-piano note))
      (println sep))
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [next-time (+ time (rand-nth seps))]
      (apply-at next-time play [next-time (rest notes) (rand-nth seps)]))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(new-play (now) (flatten cmajtriads) [100 1000])
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(new-play (now) (flatten <span style="color: #7CB8BB;">set-class</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>cmajtriads) [100 1000])
</pre>
</div>
</div></li></ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline48" class="outline-2">
<h2 id="orgheadline48"><span class="section-number-2">5</span> generate large databases of musical events</h2>
<div class="outline-text-2" id="text-5">
<p>
Once we start playing these long sequences of some related chords, it
becomes apparent that there are some obvious ways that extend this and
make it more musically interesting.
</p>
</div>
