src/post_tonal_overtone/org_files/build-voice-leading-engine.org
** transpose triply nested list
Thus begins the task of working with other structures taken from files
saved to disk.
#+BEGIN_SRC clojure :session vle
(defn tn-colls [tn coll-of-colls]
  (map (fn [coll] (map #(+ tn %) coll)) coll-of-colls))
#+END_SRC

#+RESULTS:
: #'user/tn-colls

#+BEGIN_SRC clojure :session vle
(first nested-transposed-tetrachords)
#+END_SRC

#+RESULTS:
| 11 | 12 | 13 | 14 |
| 10 | 11 | 12 | 13 |
|  9 | 10 | 11 | 12 |
|  8 |  9 | 10 | 11 |
|  7 |  8 |  9 | 10 |
|  6 |  7 |  8 |  9 |
|  5 |  6 |  7 |  8 |
|  4 |  5 |  6 |  7 |
|  3 |  4 |  5 |  6 |
|  2 |  3 |  4 |  5 |
|  1 |  2 |  3 |  4 |

#+BEGIN_SRC clojure :session vle
(first set-class/nested-transposed-tetrachords)
#+END_SRC

#+RESULTS:
| 11 | 12 | 13 | 14 |
| 10 | 11 | 12 | 13 |
|  9 | 10 | 11 | 12 |
|  8 |  9 | 10 | 11 |
|  7 |  8 |  9 | 10 |
|  6 |  7 |  8 |  9 |
|  5 |  6 |  7 |  8 |
|  4 |  5 |  6 |  7 |
|  3 |  4 |  5 |  6 |
|  2 |  3 |  4 |  5 |
|  1 |  2 |  3 |  4 |

#+BEGIN_SRC clojure :session vle
(tn-colls 60 (first nested-transposed-tetrachords))

;; (tn-colls 60 (first set-class/nested-transposed-tetrachords))
#+END_SRC

#+RESULTS:
| 71 | 72 | 73 | 74 |
| 70 | 71 | 72 | 73 |
| 69 | 70 | 71 | 72 |
| 68 | 69 | 70 | 71 |
| 67 | 68 | 69 | 70 |
| 66 | 67 | 68 | 69 |
| 65 | 66 | 67 | 68 |
| 64 | 65 | 66 | 67 |
| 63 | 64 | 65 | 66 |
| 62 | 63 | 64 | 65 |
| 61 | 62 | 63 | 64 |


#+BEGIN_SRC clojure :session vle
(subvec (vec nested-transposed-tetrachords) 0 2)
;; (subvec (vec set-class/nested-transposed-tetrachords) 0 2)
#+END_SRC

#+RESULTS:
| (11 12 13 14) | (10 11 12 13) | (9 10 11 12) | (8 9 10 11) | (7 8 9 10) | (6 7 8 9)  | (5 6 7 8) | (4 5 6 7) | (3 4 5 6) | (2 3 4 5) | (1 2 3 4) |
| (11 12 13 15) | (10 11 12 14) | (9 10 11 13) | (8 9 10 12) | (7 8 9 11) | (6 7 8 10) | (5 6 7 9) | (4 5 6 8) | (3 4 5 7) | (2 3 4 6) | (1 2 3 5) |

#+BEGIN_SRC clojure :session vle
((fn [cococ] (map #(tn-colls 60 %) cococ)) (subvec (vec nested-transposed-tetrachords) 0 3))
;; ((fn [cococ] (map #(tn-colls 60 %) cococ)) (subvec (vec set-class/nested-transposed-tetrachords) 0 3))
#+END_SRC

#+RESULTS:
| (71 72 73 74) | (70 71 72 73) | (69 70 71 72) | (68 69 70 71) | (67 68 69 70) | (66 67 68 69) | (65 66 67 68) | (64 65 66 67) | (63 64 65 66) | (62 63 64 65) | (61 62 63 64) |
| (71 72 73 75) | (70 71 72 74) | (69 70 71 73) | (68 69 70 72) | (67 68 69 71) | (66 67 68 70) | (65 66 67 69) | (64 65 66 68) | (63 64 65 67) | (62 63 64 66) | (61 62 63 65) |
| (71 72 74 75) | (70 71 73 74) | (69 70 72 73) | (68 69 71 72) | (67 68 70 71) | (66 67 69 70) | (65 66 68 69) | (64 65 67 68) | (63 64 66 67) | (62 63 65 66) | (61 62 64 65) |
** start working with keyworded maps instead of unadorned lists
*** basic uses of hashes (sets)
#+BEGIN_SRC clojure :session vle
#{:a '(1 2 3) :b '(12 13 14)}
#+END_SRC

#+RESULTS:
: #{(12 13 14) (1 2 3) :b :a}

#+BEGIN_SRC clojure :session vle
(type #{:a '(1 2 3) :b '(12 13 14)})
#+END_SRC

#+RESULTS:
: clojure.lang.PersistentHashSet
** note names vs. midi numbers--note vs. find-note-name
#+BEGIN_SRC clojure :session vle
(note :A4)
#+END_SRC

#+RESULTS:
: 69

#+BEGIN_SRC clojure :session vle
(find-note-name 21)
#+END_SRC

#+RESULTS:
: :A0

#+BEGIN_SRC clojure :session vle
(note-info "C#5")
#+END_SRC

#+RESULTS:
: '(:match "C#5"  :pitch-class :C#  :octave 5  :interval 1  :midi-note 73)
* data
#+BEGIN_SRC clojure
(def cmajtriads '((48 52 55) (48 52 67) (48 52 79) (48 64 55) (48 64 67) (48 64 79) (48 76 55) (48 76 67) (48 76 79) (60 52 55) (60 52 67) (60 52 79) (60 64 55) (60 64 67) (60 64 79) (60 76 55) (60 76 67) (60 76 79) (72 52 55) (72 52 67) (72 52 79) (72 64 55) (72 64 67) (72 64 79) (72 76 55) (72 76 67) (72 76 79)))
(def nested-transposed-tetrachords '(((11 12 13 14) (10 11 12 13) (9 10 11 12) (8 9 10 11) (7 8 9 10) (6 7 8 9) (5 6 7 8) (4 5 6 7) (3 4 5 6) (2 3 4 5) (1 2 3 4)) ((11 12 13 15) (10 11 12 14) (9 10 11 13) (8 9 10 12) (7 8 9 11) (6 7 8 10) (5 6 7 9) (4 5 6 8) (3 4 5 7) (2 3 4 6) (1 2 3 5)) ((11 12 14 15) (10 11 13 14) (9 10 12 13) (8 9 11 12) (7 8 10 11) (6 7 9 10) (5 6 8 9) (4 5 7 8) (3 4 6 7) (2 3 5 6) (1 2 4 5)) ((11 12 13 16) (10 11 12 15) (9 10 11 14) (8 9 10 13) (7 8 9 12) (6 7 8 11) (5 6 7 10) (4 5 6 9) (3 4 5 8) (2 3 4 7) (1 2 3 6)) ((11 12 13 17) (10 11 12 16) (9 10 11 15) (8 9 10 14) (7 8 9 13) (6 7 8 12) (5 6 7 11) (4 5 6 10) (3 4 5 9) (2 3 4 8) (1 2 3 7)) ((11 12 13 18) (10 11 12 17) (9 10 11 16) (8 9 10 15) (7 8 9 14) (6 7 8 13) (5 6 7 12) (4 5 6 11) (3 4 5 10) (2 3 4 9) (1 2 3 8)) ((11 12 15 16) (10 11 14 15) (9 10 13 14) (8 9 12 13) (7 8 11 12) (6 7 10 11) (5 6 9 10) (4 5 8 9) (3 4 7 8) (2 3 6 7) (1 2 5 6)) ((11 12 16 17) (10 11 15 16) (9 10 14 15) (8 9 13 14) (7 8 12 13) (6 7 11 12) (5 6 10 11) (4 5 9 10) (3 4 8 9) (2 3 7 8) (1 2 6 7)) ((11 12 17 18) (10 11 16 17) (9 10 15 16) (8 9 14 15) (7 8 13 14) (6 7 12 13) (5 6 11 12) (4 5 10 11) (3 4 9 10) (2 3 8 9) (1 2 7 8)) ((11 13 14 16) (10 12 13 15) (9 11 12 14) (8 10 11 13) (7 9 10 12) (6 8 9 11) (5 7 8 10) (4 6 7 9) (3 5 6 8) (2 4 5 7) (1 3 4 6)) ((11 12 14 16) (10 11 13 15) (9 10 12 14) (8 9 11 13) (7 8 10 12) (6 7 9 11) (5 6 8 10) (4 5 7 9) (3 4 6 8) (2 3 5 7) (1 2 4 6)) ((11 13 14 17) (10 12 13 16) (9 11 12 15) (8 10 11 14) (7 9 10 13) (6 8 9 12) (5 7 8 11) (4 6 7 10) (3 5 6 9) (2 4 5 8) (1 3 4 7)) ((11 12 14 17) (10 11 13 16) (9 10 12 15) (8 9 11 14) (7 8 10 13) (6 7 9 12) (5 6 8 11) (4 5 7 10) (3 4 6 9) (2 3 5 8) (1 2 4 7)) ((11 13 14 18) (10 12 13 17) (9 11 12 16) (8 10 11 15) (7 9 10 14) (6 8 9 13) (5 7 8 12) (4 6 7 11) (3 5 6 10) (2 4 5 9) (1 3 4 8)) ((11 12 14 18) (10 11 13 17) (9 10 12 16) (8 9 11 15) (7 8 10 14) (6 7 9 13) (5 6 8 12) (4 5 7 11) (3 4 6 10) (2 3 5 9) (1 2 4 8)) ((11 12 15 17) (10 11 14 16) (9 10 13 15) (8 9 12 14) (7 8 11 13) (6 7 10 12) (5 6 9 11) (4 5 8 10) (3 4 7 9) (2 3 6 8) (1 2 5 7)) ((11 12 16 18) (10 11 15 17) (9 10 14 16) (8 9 13 15) (7 8 12 14) (6 7 11 13) (5 6 10 12) (4 5 9 11) (3 4 8 10) (2 3 7 9) (1 2 6 8)) ((11 14 15 18) (10 13 14 17) (9 12 13 16) (8 11 12 15) (7 10 11 14) (6 9 10 13) (5 8 9 12) (4 7 8 11) (3 6 7 10) (2 5 6 9) (1 4 5 8)) ((11 12 15 18) (10 11 14 17) (9 10 13 16) (8 9 12 15) (7 8 11 14) (6 7 10 13) (5 6 9 12) (4 5 8 11) (3 4 7 10) (2 3 6 9) (1 2 5 8)) ((11 12 15 19) (10 11 14 18) (9 10 13 17) (8 9 12 16) (7 8 11 15) (6 7 10 14) (5 6 9 13) (4 5 8 12) (3 4 7 11) (2 3 6 10) (1 2 5 9)) ((11 12 16 19) (10 11 15 18) (9 10 14 17) (8 9 13 16) (7 8 12 15) (6 7 11 14) (5 6 10 13) (4 5 9 12) (3 4 8 11) (2 3 7 10) (1 2 6 9)) ((11 13 15 17) (10 12 14 16) (9 11 13 15) (8 10 12 14) (7 9 11 13) (6 8 10 12) (5 7 9 11) (4 6 8 10) (3 5 7 9) (2 4 6 8) (1 3 5 7)) ((11 13 15 18) (10 12 14 17) (9 11 13 16) (8 10 12 15) (7 9 11 14) (6 8 10 13) (5 7 9 12) (4 6 8 11) (3 5 7 10) (2 4 6 9) (1 3 5 8)) ((11 13 16 18) (10 12 15 17) (9 11 14 16) (8 10 13 15) (7 9 12 14) (6 8 11 13) (5 7 10 12) (4 6 9 11) (3 5 8 10) (2 4 7 9) (1 3 6 8)) ((11 13 15 19) (10 12 14 18) (9 11 13 17) (8 10 12 16) (7 9 11 15) (6 8 10 14) (5 7 9 13) (4 6 8 12) (3 5 7 11) (2 4 6 10) (1 3 5 9)) ((11 13 17 19) (10 12 16 18) (9 11 15 17) (8 10 14 16) (7 9 13 15) (6 8 12 14) (5 7 11 13) (4 6 10 12) (3 5 9 11) (2 4 8 10) (1 3 7 9)) ((11 14 16 19) (10 13 15 18) (9 12 14 17) (8 11 13 16) (7 10 12 15) (6 9 11 14) (5 8 10 13) (4 7 9 12) (3 6 8 11) (2 5 7 10) (1 4 6 9)) ((11 13 16 19) (10 12 15 18) (9 11 14 17) (8 10 13 16) (7 9 12 15) (6 8 11 14) (5 7 10 13) (4 6 9 12) (3 5 8 11) (2 4 7 10) (1 3 6 9)) ((11 14 17 20) (10 13 16 19) (9 12 15 18) (8 11 14 17) (7 10 13 16) (6 9 12 15) (5 8 11 14) (4 7 10 13) (3 6 9 12) (2 5 8 11) (1 4 7 10))))
#+END_SRC

#+RESULTS:
: #'user/cmajtriads#'user/nested-transposed-tetrachords

